hgr2004/ESP32_Weather/src/main.cpp
/* *****************************************************************
 *
 * SmallDesktopDisplay
 *    小型桌面显示器
 *
 * 原  作  者：Misaka
 * 修      改：微车游
 * 讨  论  群：811058758、887171863
 * 创 建 日 期：2021.07.19
 * 最后更改日期：2021.09.14
 * 更 改 说 明：V1.1添加串口调试，波特率115200\8\n\1；增加版本号显示。
 *            V1.2亮度和城市代码保存到EEPROM，断电可保存
 *            V1.3.1 更改smartconfig改为WEB配网模式，同时在配网的同时增加亮度、屏幕方向设置。
 *            V1.3.2 增加wifi休眠模式，仅在需要连接的情况下开启wifi，其他时间关闭wifi。增加wifi保存至eeprom（目前仅保存一组ssid和密码）
 *            V1.3.3  修改WiFi保存后无法删除的问题。目前更改为使用串口控制，输入 0x05 重置WiFi数据并重启。
 *                    增加web配网以及串口设置天气更新时间的功能。
 *            V1.3.4  修改web配网页面设置，将wifi设置页面以及其余设置选项放入同一页面中。
 *                    增加web页面设置是否使用DHT传感器。（使能DHT后才可使用）
 *
 * 引 脚 分 配： SCK  GPIO14
 *              MOSI  GPIO15
 *              RES   GPIO33
 *              DC    GPIO27
 *              LCDBL GPIO22
 *              CS    GPIO5
 *
 *             增加DHT11温湿度传感器，传感器接口为 GPIO 13
 *
 *    感谢群友 @你别失望  提醒发现WiFi保存后无法重置的问题，目前已解决。详情查看更改说明！

 *  烧录方式：
 * 使用USB转TTL烧录器
 * 板子上G接烧录器GND
 * 板子上3接烧录器3.3v
 * 板子上T接烧录器RXD
 * 板子上R接烧录器TXD
 * 烧录时按住boot键不放再按一下en键即可进入下载模式

 * *****************************************************************/

/* *****************************************************************
 *  库文件、头文件
 * *****************************************************************/
#include <Arduino.h>
#include "main.h"
#include <string.h>
#include "ArduinoJson.h"
#include <TimeLib.h>

// Gzip相关定义
#ifndef ESP32
#error "gzStreamExpander is only available on ESP32 architecture"
#endif
#define DEST_FS_USES_LITTLEFS

#include <HTTPClient.h>
#include <WiFiClientSecure.h>
#include <WiFiUdp.h>
#include <TFT_eSPI.h>
#include <SPI.h>
#include <TJpg_Decoder.h>
#include <EEPROM.h>
#include "qr.h"
#include "number.h"
#include "weathernum.h"
#include <NTPClient.h>
#include <ESP32Time.h>
#include <ESP32-targz.h>
#include "esp32-hal-cpu.h"
#include <DigitalRainAnimation.hpp>

#include "WeatherWarn.h"
#include "HttpsGetUtils.h"
#include <Ticker.h> // 使用Ticker库，需要包含头文件

// Font files are stored in Flash FS
#include <FS.h>
#include <LittleFS.h>
// #include <LITTLEFS.h>
#define FlashFS LittleFS
// #define FlashFS LITTLEFS
#define FORMAT_LITTLEFS_IF_FAILED true

#define Version "SDD V1.9.9"
#define MaxScroll 50 // 定义最大滚动显示条数

#define UseMutex // 多任务使用变量互斥
SemaphoreHandle_t shared_var_mutex_pushImage = NULL;
SemaphoreHandle_t shared_var_mutex_pushSprite = NULL;
SemaphoreHandle_t shared_var_mutex_loop = NULL;

static TaskHandle_t TaskA_Handle = NULL; /* 创建A任务句柄 */
static TaskHandle_t TaskB_Handle = NULL; /* B任务句柄 */
static TaskHandle_t TaskC_Handle = NULL; /* C任务句柄 */
static TaskHandle_t TaskD_Handle = NULL; /* D任务句柄 */
// ————————————————
// 版权声明：本文为CSDN博主「不秃也很强」的原创文章，遵循CC 4.0 BY-SA版权协议，转载请附上原文出处链接及本声明。
// 原文链接：https://blog.csdn.net/qq_61672347/article/details/125554394

/* *****************************************************************
 *  请前往相关的网站申请key
 * *****************************************************************/
// 和风天气的key 申请地址： https://dev.qweather.com/docs/start/
String HeUserKey = "";
WeatherWarn weatherWarn;

// 电点工作室/mxnzp.com  申请地址：https://www.mxnzp.com/   一个个人维护的站点
String mx_id = "";
String mx_secret = "";

/* *****************************************************************
 *  配置使能位
 * *****************************************************************/
// WEB配网使能标志位----WEB配网打开后会默认关闭smartconfig功能
#define WM_EN 1
// Web服务器使能标志位----打开后将无法使用wifi休眠功能。
#define WebSever_EN 1
// 设定DHT11温湿度传感器使能标志
#define DHT_EN 1
// 设置太空人图片是否使用
#define imgAst_EN 1

#if WM_EN
#include <WiFiManager.h>
// WiFiManager 参数
WiFiManager wm; // global wm instance
#endif

#if WebSever_EN
// #include "ESPAsyncWebServer.h"
// #include <DNSServer.h>
#include <WiFi.h>
#include <WiFiClient.h>
#include <ESPmDNS.h>
#include <WiFiClient.h>
#include <WebServer.h>

// 设置ESP32服务器运行于80端口
// AsyncWebServer server(80);
WebServer server(80); // 建立esp8266网站服务器对象
#endif

// 设定DHT11温湿度传感器引脚
#if DHT_EN
#include "DHT.h"
#define DHTPIN 13
#define DHTTYPE DHT11
DHT dht(DHTPIN, DHTTYPE);
#endif

/* *****************************************************************
 *  字库、图片库
 * *****************************************************************/
#include "font/ZdyLwFont_20.h"
#include "font/ZdXiao.h"
#include "img/misaka.h"
#include "img/temperature.h"
#include "img/humidity.h"

#if imgAst_EN
#include "img/pangzi/i0.h"
#include "img/pangzi/i1.h"
#include "img/pangzi/i2.h"
#include "img/pangzi/i3.h"
#include "img/pangzi/i4.h"
#include "img/pangzi/i5.h"
#include "img/pangzi/i6.h"
#include "img/pangzi/i7.h"
#include "img/pangzi/i8.h"
#include "img/pangzi/i9.h"

int Anim = 0;                // 太空人图标显示指针记录
unsigned long AprevTime = 0; // 太空人更新时间记录
#endif

/* *****************************************************************
 *  参数设置
 * *****************************************************************/

struct config_type
{
  char stassid[32]; // 定义配网得到的WIFI名长度(最大32字节)
  char stapsw[64];  // 定义配网得到的WIFI密码长度(最大64字节)
};

//---------------修改此处""内的信息--------------------
// 如开启WEB配网则可不用设置这里的参数，前一个为wifi ssid，后一个为密码
config_type wificonf = {{""}, {""}};

//----------------------------------------------------
// LCD屏幕相关设置
TFT_eSPI tft = TFT_eSPI(); // 引脚请自行配置tft_espi库中的 User_Setup.h文件
TFT_eSprite clk = TFT_eSprite(&tft);
TFT_eSprite clkJpeg = TFT_eSprite(&tft);

// 黑客帝国数字雨效果
DigitalRainAnimation<TFT_eSPI> matrix_effect = DigitalRainAnimation<TFT_eSPI>();

#define LCD_BL_PIN 22 // LCD背光引脚
#define MINLIGHT 88   // 背光最小亮度-定时器夜晚调到最小
const uint16_t bgColor = 0x0000;

// 屏幕亮度调节
int pwm_channel0 = 0;
int pwm_freq = 5000;
// int pwm_value = 10;    //0-255

// 其余状态标志位
int LCD_Rotation = 0;        // LCD屏幕方向
int LCD_BL_PWM = 250;        // 屏幕亮度0-255，默认250
uint8_t Wifi_en = 1;         // wifi状态标志位  1：打开    0：关闭
uint8_t UpdateWeater_en = 0; // 更新时间标志位
uint8_t UpdateNL_en = 0;     // 更新农历标志位
uint8_t isNewWeather = 0;    // 天气更新后
bool isNewWarn = false;      // 预警更新标志
int prevTime = 1;            // 滚动显示更新标志位
int DHT_img_flag = 0;        // DHT传感器使用标志位
bool UpdateScreen = 0;       // 全部重画屏幕
bool finishNL = false;       // 农历取数完毕

int prevDisplay = 0;          // 显示时间显示记录
unsigned long weaterTime = 0; // 天气更新时间记录

String scrollText[7] = {""}; // 天气情况滚动显示数组

