hgr2004/ESP32_Weather/src/main.cpp
/*** Component objects ***/
Number dig;
WeatherNum wrat;

// 增加和风天气的预警功能
uint32_t targetTime = 0;
String cityCode = "101281006"; // 天气城市代码 湛江： 101281001 长沙: 101250101 株洲: 101250301 衡阳: 101250401 赤坎： 101281006  霞山 101281009
int tempnum = 0;               // 温度百分比
int huminum = 0;               // 湿度百分比
int tempcol = 0xffff;          // 温度显示颜色
int humicol = 0xffff;          // 湿度显示颜色
int pm25V = 0;                 // PM2.5
int Iconsname;                 // 天气图标名称
String cityname = "";          // 城市名称
// 天气更新时间  默认20分钟
int updateweater_time = 20;

// EEPROM参数存储地址位
int BL_addr = 1;    // 被写入数据的EEPROM地址编号  1亮度
int Ro_addr = 2;    // 被写入数据的EEPROM地址编号  2 旋转方向
int DHT_addr = 3;   // 被写入数据的EEPROM地址编号  3 DHT使能标志位
int UpWeT_addr = 4; // 更新时间记录
int CC_addr = 10;   // 被写入数据的EEPROM地址编号  10城市
int wifi_addr = 30; // 被写入数据的EEPROM地址编号  20wifi-ssid-psw

// wifi连接UDP设置参数
WiFiUDP Udp;
WiFiClient wificlient;
unsigned int localPort = 8321;
float duty = 0;
bool LostWiFi = false;

// NTP服务器参数
const int timeZone = 8; // 东八区

// WiFiUDP ntpUDP;
//  IPAddress NtpIP = IPAddress(210,72,145,44);  //国家授时中心
NTPClient timeClient(Udp, "ntp6.aliyun.com", 60 * 60 * timeZone, 12 * 60 * 60 * 1000); // ntp.ntsc.ac.cn
ESP32Time rtc;                                                                         // 用来管理系统时间

// 定时器定义
hw_timer_t *timer = NULL; // 声明一个定时器用来定时切换字幕
unsigned int updateTime = 0;

Ticker timerDHT; // 声明一个软件定时器用来取DHT11数据
unsigned int updateDHT = 0;

// 进度条
byte loadNum = 6;

// 设计一个结构体，实现不同意思字显示不同颜色
#define cRED 0
#define cGREEN 1
#define cWHITE 2

typedef struct
{
  int color;
  String title;
} Display;

#define LENGTH(array) (sizeof(array) / sizeof(array[0]))

Display *scrollNongLi = NULL;
Display *scrolHEAD = NULL;
Display *scrollYI = NULL;
Display *scrollJI = NULL;
int TotalDis = 0;
int TotalHEAD = 0;
int TotalYI = 0;
int TotalJI = 0;
int CurrentDisDate = 0;

// 绘制预警画面有关变量定义
#define DEG2RAD 0.0174532925
#define LOOP_DELAY 1 // Loop delay to slow things down

byte inc = 0;
unsigned int col = 0;

byte red = 31;  // Red is the top 5 bits of a 16 bit colour value
byte green = 0; // Green is the middle 6 bits
byte blue = 0;  // Blue is the bottom 5 bits
byte state = 0;

/* *********************************************************/
/*  ***************函数定义**********************************/
/* *********************************************************/
void getCityCode();
void getCityWeater();
void saveParamCallback();
void scrollBanner();
void scrollDate();
void imgAnim();
void weaterData();
String monthDay();
String week();
void getNongli();
/* *********************************************************/
/*  ********************************************************/
/* *********************************************************/
// 函数声明
time_t getNtpTime();
void digitalClockDisplay(int reflash_Clock);
void printDigits(int digits);
String num2str(int digits);
void sendNTPpacket(IPAddress &address);
void LCD_reflash(bool en);
void savewificonfig();
void readwificonfig();
void deletewificonfig();
int StrSplit(String str, String fen, String *result);
void IRAM_ATTR onTimer();
void IRAM_ATTR onTimer_dht();
void ledcAnalogWrite(uint8_t channel, uint32_t value);
bool tft_output(int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t *bitmap);
bool tft_output_Warn(int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t *bitmap);
bool tft_output_Anim(int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t *bitmap);
bool tft_output_Anim2(int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t *bitmap);
void Web_win();
void Webconfig();
void loading(byte delayTime); // 绘制进度条
void IndoorTem();
void Serial_set();
void sleepTimeLoop(uint8_t Maxlight, uint8_t Minlight);
void taskA(void *ptParam);
void taskB(void *ptParam);
void taskC(void *ptParam);
void taskD(void *ptParam);
void getDHT11();
void myTarProgressCallback(uint8_t progress);
void my_strcat_arrcy(Display *arr, int lena, Display *brr, int lenb, Display *crr, int lenc, Display *str);
String HTTPS_request(String host, String url, String parameter);
void getWarning();
void DispWarn();
void Wait_win(String showStr);

void fillArc(int x, int y, int start_angle, int seg_count, int rx, int ry, int w, unsigned int colour);
unsigned int brightness(unsigned int colour, int brightness);
unsigned int rainbow(byte value);
void SaveConfigCallback();
void dispScrolls();
void drawTemIcons();

#if WebSever_EN
void Web_Sever_Init();
void Web_Sever();
void Web_sever_Win();
void saveCityCodetoEEP(int *citycode);
void readCityCodefromEEP(int *citycode);
void handleconfig();
#endif
/* *********************************************************/

void setup()
{
  Serial.begin(115200);

  WiFi.enableSTA(true);

  setCpuFrequencyMhz(240);
  Serial.print("CPU频率是： ");
  Serial.println(getCpuFrequencyMhz());

  tft.begin();          /* TFT init */
  tft.invertDisplay(1); // 反转所有显示颜色：1反转，0正常
  tft.setRotation(LCD_Rotation);
  tft.initDMA();
  tft.fillScreen(bgColor);
  tft.setTextColor(TFT_BLACK, bgColor);

  // 多任务使用变量互斥
  shared_var_mutex_pushImage = xSemaphoreCreateMutex();  // Create the mutex
  shared_var_mutex_pushSprite = xSemaphoreCreateMutex(); // Create the mutex
  shared_var_mutex_loop = xSemaphoreCreateMutex();       // Create the mutex

  TJpgDec.setJpgScale(1);
  TJpgDec.setSwapBytes(true);
  TJpgDec.setCallback(tft_output);

  if (!FlashFS.begin(!FORMAT_LITTLEFS_IF_FAILED))
  {
    Serial.println("Flash FS initialisation failed!");
  }
  else
  {
    Serial.println("Flash FS available!");
  }
  // 显示开机LOGO
  TJpgDec.drawFsJpg(0, 0, "/logo.jpg", FlashFS);
  delay(3000); // 花一些时间打开串行监视器

  EEPROM.begin(1024);

  // 屏幕亮度控制初始化
  //  initialize digital pin LED_BUILTIN as an output.
  ledcSetup(pwm_channel0, pwm_freq, 13);
  ledcAttachPin(LCD_BL_PIN, pwm_channel0);

  // 设置一个定时器处理定时任务 0.1秒
  timer = timerBegin(0, 80, true);             // 初始化定时器指针
  timerAttachInterrupt(timer, &onTimer, true); // 绑定定时器
  timerAlarmWrite(timer, 100000, true);        // 配置报警计数器保护值（就是设置时间）单位uS 定时100ms
  timerAlarmEnable(timer);                     // 启用定时器

  // 设置一个软件定时器处理定时任务 10秒
  timerDHT.attach(10, onTimer_dht); // 设置定时器，每隔 10 秒钟调用一次 DHT 函数 恢复DTH11读取任务

#if DHT_EN
  dht.begin();
  // 从eeprom读取DHT传感器使能标志
  DHT_img_flag = EEPROM.read(DHT_addr);
#endif
  // 从eeprom读取天气更新时间间隔设置
  if (EEPROM.read(UpWeT_addr) > 0 && EEPROM.read(UpWeT_addr) < 60)
    updateweater_time = EEPROM.read(UpWeT_addr);
  // 从eeprom读取背光亮度设置
  if (EEPROM.read(BL_addr) > 0 && EEPROM.read(BL_addr) < 255)
    LCD_BL_PWM = EEPROM.read(BL_addr);
  // 从eeprom读取屏幕方向设置
  if (EEPROM.read(Ro_addr) >= 0 && EEPROM.read(Ro_addr) <= 3)
    LCD_Rotation = EEPROM.read(Ro_addr);
  // 设置背光
  ledcAnalogWrite(pwm_channel0, LCD_BL_PWM);

  // 黑客帝国效果
  matrix_effect.init(&tft);
  matrix_effect.setup(
      10 /* Line Min */,
      30, /* Line Max */
      5,  /* Speed Min */
      25, /* Speed Max */
      50 /* Screen Update Interval */);

  readwificonfig(); // 读取存储的wifi信息
  Serial.print("正在连接WIFI ");
  Serial.println(String(wificonf.stassid));

  if (WiFi.mode(WIFI_STA))
  {
    WiFi.begin(wificonf.stassid, wificonf.stapsw);
    WiFi.setAutoReconnect(true);
  }
  else
  {
    esp_restart(); // 重启
  }

  tft.fillScreen(bgColor);
  while (WiFi.status() != WL_CONNECTED)
  {
    loading(30);
    if (loadNum >= 197)
    {
// 使能web配网后自动将smartconfig配网失效
#if WM_EN
      Web_win();
      Webconfig();
      tft.fillScreen(bgColor);
#endif

