hgr2004/ESP32_Weather/src/main.cpp
#if !WM_EN
      SmartConfig();
#endif
      break;
    }
  }

  while (loadNum < 194) // 让动画走完
  {
    loading(1);
  }

  Wait_win("WIFI已连接......"); // 显示连接成功后界面

  Serial.print("本地IP： ");
  Serial.println(WiFi.localIP());
  Serial.println("启动UDP");
  Udp.begin(localPort);
  Serial.println("等待同步...");

  timeClient.begin();
  timeClient.update();

  Wait_win("等待时间服务器..."); // 显示连接成功后界面

  loadNum = 20;
  while (rtc.getYear() == 1970)
  {

    if (millis() - AprevTime > 500) // x ms切换一次
    {
      AprevTime = millis();
      Wait_win("正在同步时间...");
      getNtpTime();
      if (timeClient.isTimeSet())
        Serial.println(rtc.getTime("%A, %B %d %Y %H:%M:%S")); // (String) returns time with specified format
      loadNum += 19;
    }
    if (loadNum >= 170)
    {
      Serial.println("获取NTP时间失败，手动设置一个时间：2023-6-18-1-1-1"); // 如果同步失败，手动设置一个系统时间。
      rtc.setTime(01, 01, 01, 18, 6, 2023);                                 // 17th Jan 2021 15:24:30
      loadNum = 194;
      break;
    }
  }

  while (loadNum < 170) // 让动画走完
  {
    Wait_win("时间同步成功...");
    loadNum += 39;
  }
  loadNum = 194;

  // 每 60 * 60 秒同步时间一次
  setSyncProvider(getNtpTime);
  setSyncInterval(60 * 60); // 每60分钟同步一次时间

  Wait_win("正在城市信息..."); // 显示连接成功后界面
  // 获取城市代码
  int CityCODE = 0;
  for (int cnum = 5; cnum > 0; cnum--)
  {
    CityCODE = CityCODE * 100;
    CityCODE += EEPROM.read(CC_addr + cnum - 1);
    delay(5);
  }
  if (CityCODE >= 101000000 && CityCODE <= 102000000)
    cityCode = CityCODE;
  else
    getCityCode();                    // 获取城市代码
  Wait_win("正在获取农历信息......"); // 显示连接成功后界面
  getNongli();                        // 农历信息
  Wait_win("正在获取天气情况......"); // 显示连接成功后界面
  getCityWeater();                    // 取天气情况
  Wait_win("正在获取预警信息......"); // 显示连接成功后界面
  // 使用城市ID取当前预警
  weatherWarn.config(HeUserKey, cityCode); // 配置请求信息  101230201厦门 101230201 厦门  101281006 湛江 101281009 霞山
  getWarning();                            // 取当前预警
  Wait_win("等待启动WEB服务...");          // 显示连接成功后界面

#if WebSever_EN
  // 开启web服务器初始化
  Web_Sever_Init();
  Web_sever_Win();
  delay(6000);
#endif

#if DHT_EN
  if (DHT_img_flag != 0)
  {
    getDHT11();
    IndoorTem();
  }
#endif
  drawTemIcons();

  // 任务A          任务B          tskNO_AFFINITY 表示不指定核心
  xTaskCreatePinnedToCore(taskA, "Task A", 1024 * 8, NULL, 1, (TaskHandle_t *)&TaskA_Handle, 0);
  xTaskCreatePinnedToCore(taskB, "Task B", 1024 * 5, NULL, 3, (TaskHandle_t *)&TaskB_Handle, 1); // configMAX_PRIORITIES - 1
  xTaskCreatePinnedToCore(taskC, "Task C", 1024 * 4, NULL, 2, (TaskHandle_t *)&TaskC_Handle, 1);
  xTaskCreatePinnedToCore(taskD, "Task D", 1024 * 3, NULL, 4, (TaskHandle_t *)&TaskD_Handle, 1);

  tft.fillScreen(TFT_BLACK); // 清屏
  weaterTime = millis();
}

void loop()
{
  vTaskDelete(NULL);
}
// Serial.println("check 1:");
// Serial.printf("FreeHeap:%d\r\n", ESP.getFreeHeap());

/* ***************************************************************************
 *  以下各类函数
 *
 * **************************************************************************/
// 任务A webserver
void taskA(void *ptParam)
{
  while (1)
  {
#ifdef UseMutex
    SmartLocker smartLocker(&shared_var_mutex_loop, portMAX_DELAY);
    if (smartLocker.IsLocked())
    {
#endif
      if (!isNewWarn)
      {
#if WebSever_EN
        Web_Sever();
#endif
        Serial_set();
        LCD_reflash(UpdateScreen);
      }
      // printf("TaskA剩余栈%d\r\n", uxTaskGetStackHighWaterMark(NULL)); // uxTaskGetStackHighWaterMark以word为单位
      //     Serial.print("taskA: priority = ");
      //     Serial.println(uxTaskPriorityGet(NULL));
#ifdef UseMutex
    }
#endif
  }
}

// 任务B用来*********
void taskB(void *ptParam)
{
  TickType_t xLastWakeTime;
  const TickType_t xDelayms = pdMS_TO_TICKS(150); // 1000ms
  xLastWakeTime = xTaskGetTickCount();
  while (1)
  {
    vTaskDelayUntil(&xLastWakeTime, xDelayms);
    // 绘制时分秒
    if ((!isNewWarn) && (isNewWeather == 0) && (UpdateWeater_en == 0) && (UpdateNL_en == 0))
    {


      if (UpdateScreen == 1)
      {
        digitalClockDisplay(1);
        UpdateScreen = 0;
      }
      else
      {
        digitalClockDisplay(0);
      }

      imgAnim();

      // 绘制室内温度
#if DHT_EN
      if (DHT_img_flag != 0)
        IndoorTem();
#endif
    }

    sleepTimeLoop(LCD_BL_PWM, MINLIGHT); // 定时开关显示屏背光 参数是打开后最大亮度
    //printf("TaskB剩余栈%d\r\n", uxTaskGetStackHighWaterMark(NULL)); // uxTaskGetStackHighWaterMark以word为单位
    //     printf("xPortGetFreeHeapSize = %d\r\n", xPortGetFreeHeapSize());
    //     printf("xPortGetMinimumEverFreeHeapSize = %d\r\n", xPortGetMinimumEverFreeHeapSize());
    //     Serial.print("taskB: priority = ");
    //     Serial.println(uxTaskPriorityGet(NULL));
  }
}

// 任务C用来*********
void taskC(void *ptParam)
{
  TickType_t xLastWakeTime;
  const TickType_t xDelayms = pdMS_TO_TICKS(100); // 1000ms
  xLastWakeTime = xTaskGetTickCount();
  while (1)
  {
    vTaskDelayUntil(&xLastWakeTime, xDelayms);

#ifdef UseMutex
    SmartLocker smartLocker(&shared_var_mutex_loop, portMAX_DELAY);
    if (smartLocker.IsLocked())
    {
#endif
      if (isNewWarn)
      {
        vTaskSuspend(TaskB_Handle);
        DispWarn();
        isNewWarn = false;

        imgAnim();        
        digitalClockDisplay(1);      
        drawTemIcons();
        wrat.printfweather(160, 15, Iconsname);
        weaterData();

        vTaskResume(TaskB_Handle);
      }

      if (isNewWeather == 1 && isNewWarn == 0 && UpdateNL_en == 0 && UpdateScreen == 0)
      {
        drawTemIcons();
        // 天气图标  170,15
        wrat.printfweather(160, 15, Iconsname);
        weaterData();
        isNewWeather = 0;
      }

      if (!isNewWarn && UpdateScreen == 0)
      {
        // 显示上下两个滚动字幕
        dispScrolls();
      }

      if (TaskD_Handle != NULL && updateDHT == 1)
      {
        updateDHT = 0;
        vTaskResume(TaskD_Handle); // 恢复DHT11任务
      }

#ifdef UseMutex
    }
#endif
    //printf("TaskC剩余栈%d\r\n", uxTaskGetStackHighWaterMark(NULL)); // uxTaskGetStackHighWaterMark以word为单位
    //    printf("xPortGetFreeHeapSize = %d\r\n", xPortGetFreeHeapSize());
    //    printf("xPortGetMinimumEverFreeHeapSize = %d\r\n", xPortGetMinimumEverFreeHeapSize());
    //    Serial.print("taskB: priority = ");
    //    Serial.println(uxTaskPriorityGet(NULL));
  }
}

