hgr2004/ESP32_Weather/src/main.cpp
// 任务D用来*********
void taskD(void *ptParam)
{

  while (1)
  {
    if (!isNewWarn)
    {

      if (DHT_img_flag != 0)
      {
        getDHT11(); // 采集DHT11温湿度传感器
      }
    }
    vTaskSuspend(NULL); // 这里是把自己挂起，挂起后该任务被暂停，不恢复是不运行的

    // printf("TaskD剩余栈%d\r\n", uxTaskGetStackHighWaterMark(NULL)); // uxTaskGetStackHighWaterMark以word为单位
    //    printf("xPortGetFreeHeapSize = %d\r\n", xPortGetFreeHeapSize());
    //    printf("xPortGetMinimumEverFreeHeapSize = %d\r\n", xPortGetMinimumEverFreeHeapSize());
    //    Serial.print("taskB: priority = ");
    //    Serial.println(uxTaskPriorityGet(NULL));
  }
}

void IRAM_ATTR onTimer()
{               // 定时器中断函数
  updateTime++; // 加0.1秒
}

void IRAM_ATTR onTimer_dht()
{                // 定时器中断函数
  updateDHT = 1; //
}

/* *****************************************************************
 *  函数
 * *****************************************************************/
// wifi ssid，psw保存到eeprom
void savewificonfig()
{
  // 开始写入
  uint8_t *p = (uint8_t *)(&wificonf);
  for (int i = 0; i < sizeof(wificonf); i++)
  {
    EEPROM.write(i + wifi_addr, *(p + i)); // 在闪存内模拟写入
  }
  delay(10);
  EEPROM.commit(); // 执行写入ROM
  delay(10);
}
// 删除原有eeprom中的信息
void deletewificonfig()
{
  config_type deletewifi = {{""}, {""}};
  uint8_t *p = (uint8_t *)(&deletewifi);
  for (int i = 0; i < sizeof(deletewifi); i++)
  {
    EEPROM.write(i + wifi_addr, *(p + i)); // 在闪存内模拟写入
  }
  delay(10);
  EEPROM.commit(); // 执行写入ROM
  delay(10);
}

// 从eeprom读取WiFi信息ssid，psw
void readwificonfig()
{
  uint8_t *p = (uint8_t *)(&wificonf);
  for (int i = 0; i < sizeof(wificonf); i++)
  {
    *(p + i) = EEPROM.read(i + wifi_addr);
  }
  for (int i = 0; i < 32; i++)
  {
    if (wificonf.stassid[i] == '\0')
      break;
    if (!isPrintable(wificonf.stassid[1]))
    {
      deletewificonfig();
      esp_restart(); // 重启
      break;
    }
  }
  for (int i = 0; i < 64; i++)
  {
    if (wificonf.stapsw[i] == '\0')
      break;
    if (!isPrintable(wificonf.stapsw[i]))
    {
      deletewificonfig();
      esp_restart(); // 重启
      break;
    }
  }

}

// portMUX_TYPE mux = portMUX_INITIALIZER_UNLOCKED;
//  TFT屏幕输出函数
bool tft_output(int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t *bitmap)
{
  // if (y + h >= tft.height() || x + w >= tft.width())
  //   return 0;

  clkJpeg.setColorDepth(8);
  clkJpeg.createSprite(w, h);
  clkJpeg.fillSprite(TFT_BLACK);

  SmartLocker smartLocker(&shared_var_mutex_pushImage, portMAX_DELAY);
  if (smartLocker.IsLocked())
  {
    clkJpeg.pushImage(0, 0, w, h, bitmap);
  }

  SmartLocker smartLocker2(&shared_var_mutex_pushSprite, portMAX_DELAY);
  if (smartLocker2.IsLocked())
  {
    clkJpeg.pushSprite(x, y);
  }
  clkJpeg.deleteSprite();
  // Return 1 to decode next block
  return 1;
}
// TFT屏幕输出函数_太空人动画专用
bool tft_output_Anim(int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t *bitmap)
{
  uint16_t iColor;

  // if (y >= tft.height())
  //   return 0;

  clkJpeg.setColorDepth(8);
  clkJpeg.createSprite(w, h);
  clkJpeg.fillSprite(TFT_BLACK);

  SmartLocker smartLocker(&shared_var_mutex_pushImage, portMAX_DELAY);
  if (smartLocker.IsLocked())
  {
    clkJpeg.pushImage(0, 0, w, h, bitmap);
  }

  for (int32_t i = 0; i < w; i++)
  {
    for (int32_t j = 0; j < h; j++)
    {
      iColor = clkJpeg.readPixel(i, j);
      if (iColor != 0x0000)
      {
        clkJpeg.drawPixel(i, j, TFT_RED);
      }
      else
      {
        clkJpeg.drawPixel(i, j, TFT_BLACK);
      }
    }
  }

  SmartLocker smartLocker2(&shared_var_mutex_pushSprite, portMAX_DELAY);
  if (smartLocker2.IsLocked())
  {
    clkJpeg.pushSprite(x, y);
  }

  clkJpeg.deleteSprite();

  // Return 1 to decode next block
  return 1;
}
// TFT屏幕输出函数_太空人动画专用
bool tft_output_Anim2(int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t *bitmap)
{
  uint16_t iColor;

  // if (y >= tft.height())
  //   return 0;

  clkJpeg.setColorDepth(8);
  clkJpeg.createSprite(w, h);
  clkJpeg.fillSprite(TFT_BLACK);

  SmartLocker smartLocker(&shared_var_mutex_pushImage, portMAX_DELAY);
  if (smartLocker.IsLocked())
  {
    clkJpeg.pushImage(0, 0, w, h, bitmap);
  }

  for (int32_t i = 0; i < w; i++)
  {
    for (int32_t j = 0; j < h; j++)
    {
      iColor = clkJpeg.readPixel(i, j);
      if (iColor != 0x0000)
      {
        clkJpeg.drawPixel(i, j, TFT_YELLOW);
      }
      else
      {
        clkJpeg.drawPixel(i, j, TFT_BLACK);
      }
    }
  }

  SmartLocker smartLocker2(&shared_var_mutex_pushSprite, portMAX_DELAY);
  if (smartLocker2.IsLocked())
  {
    clkJpeg.pushSprite(x, y);
  }

  clkJpeg.deleteSprite();

  // Return 1 to decode next block
  return 1;
}
// TFT屏幕输出函数_天气告警专用
bool tft_output_Warn(int16_t x, int16_t y, uint16_t w, uint16_t h, uint16_t *bitmap)
{
  uint16_t iColor;
  String sColor = weatherWarn.getColor();

  if (y >= tft.height())
    return 0;

  clk.setColorDepth(8);
  clk.createSprite(w, h);
  clk.fillSprite(TFT_BLACK);
  clk.pushImage(0, 0, w, h, bitmap);

  for (int32_t i = 0; i < w; i++)
  {
    for (int32_t j = 0; j < h; j++)
    {
      iColor = clk.readPixel(i, j);
      if (iColor != 0xffff)
      {
        if (sColor.equals("White"))
          clk.drawPixel(i, j, brightness(TFT_LIGHTGREY, 60));
        else if (sColor.equals("Blue"))
          clk.drawPixel(i, j, brightness(TFT_BLUE, 60));
        else if (sColor.equals("Green"))
          clk.drawPixel(i, j, brightness(TFT_GREEN, 60));
        else if (sColor.equals("Yellow"))
          clk.drawPixel(i, j, brightness(TFT_YELLOW, 60));
        else if (sColor.equals("Orange"))
          clk.drawPixel(i, j, brightness(TFT_ORANGE, 60));
        else if (sColor.equals("Red"))
          clk.drawPixel(i, j, brightness(TFT_RED, 60));
        else if (sColor.equals("Black"))
          clk.drawPixel(i, j, brightness(TFT_BLACK, 60));
        else
          clk.drawPixel(i, j, brightness(TFT_GREENYELLOW, 60)); // unsigned int brightness(unsigned int colour, int brightness)
      }
      else
      {
        clk.drawPixel(i, j, TFT_WHITE);
      }
    }
  }

  clk.pushSprite(x, y);
  clk.deleteSprite();

  // Return 1 to decode next block
  return 1;
}
// 进度条函数
void loading(byte delayTime) // 绘制进度条
{
  clk.setColorDepth(8);

  clk.createSprite(200, 100); // 创建窗口
  clk.fillSprite(0x0000);     // 填充率

  clk.drawRoundRect(0, 0, 200, 16, 8, 0xFFFF);        // 空心圆角矩形
  clk.fillRoundRect(3, 3, loadNum, 10, 5, TFT_GREEN); // 实心圆角矩形
  clk.setTextDatum(CC_DATUM);                         // 设置文本数据
  clk.setTextColor(TFT_GREEN, 0x0000);
  clk.drawString("Connecting to WiFi......", 100, 40, 2);
  clk.setTextColor(TFT_WHITE, 0x0000);
  clk.drawRightString(Version, 180, 60, 2);
  clk.pushSprite(20, 120); // 窗口位置
  clk.deleteSprite();
  loadNum += 1;
  delay(delayTime);
}

// 湿度图标显示函数
void humidityWin()
{
  clk.setColorDepth(8);
  huminum = huminum * (44 - 1) / 100;
  clk.createSprite(44, 6);                         // 创建窗口
  clk.fillSprite(0x0000);                          // 填充率
  clk.drawRoundRect(0, 0, 44, 6, 3, 0xFFFF);       // 空心圆角矩形  起始位x,y,长度，宽度，圆弧半径，颜色
  clk.fillRoundRect(1, 1, huminum, 4, 2, humicol); // 实心圆角矩形
  clk.pushSprite(72, 222);                         // 窗口位置
  clk.deleteSprite();
}

// 温度图标显示函数
void tempWin()
{
  clk.setColorDepth(8);
  tempnum = tempnum + 10;
  clk.createSprite(66, 6);                         // 创建窗口
  clk.fillSprite(0x0000);                          // 填充率
  clk.drawRoundRect(0, 0, 66, 6, 3, 0xFFFF);       // 空心圆角矩形  起始位x,y,长度，宽度，圆弧半径，颜色
  clk.fillRoundRect(1, 1, tempnum, 4, 2, tempcol); // 实心圆角矩形
  clk.pushSprite(50, 192);                         // 窗口位置
  clk.deleteSprite();
}

#if DHT_EN

float DHT11_T = 0;
float DHT11_H = 0;

// 取数，在多任务调用。
bool NewDht = 0;
void getDHT11()
{
  DHT11_T = dht.readTemperature();
  DHT11_H = dht.readHumidity();
  NewDht = 1;
}

// 外接DHT11传感器，显示数据
void IndoorTem()
{
  if (!NewDht)
    return;
  NewDht = 0;
  float t = DHT11_T;
  float h = DHT11_H;
  // /***绘制相关文字***/
  clk.setColorDepth(8);
  clk.loadFont(ZdyLwFont_20);
  tft.drawRoundRect(170, 112, 66, 48, 5, TFT_YELLOW); // 室内温湿度框
  // //位置
  // 温度
  clk.createSprite(60, 24);
  clk.fillSprite(bgColor);
  clk.setTextDatum(CC_DATUM);
  clk.setTextColor(TFT_CYAN, bgColor);
  clk.drawFloat(t, 1, 20, 13);
  clk.drawString("℃", 50, 13);
  clk.pushSprite(173, 112); // 184
  clk.deleteSprite();

