hgr2004/ESP32_Weather/src/main.cpp
  // 湿度
  clk.createSprite(60, 24);
  clk.fillSprite(bgColor);
  clk.setTextDatum(CC_DATUM);
  clk.setTextColor(TFT_GREENYELLOW, bgColor);
  clk.drawFloat(h, 1, 20, 13);
  clk.drawString("%", 50, 13);
  clk.pushSprite(173, 136); // 214
  clk.deleteSprite();
}
#endif

#if !WM_EN
// 微信配网函数
void SmartConfig(void)
{
  WiFi.mode(WIFI_STA); // 设置STA模式
  tft.pushImage(0, 0, 240, 240, qr);
  Serial.println("\r\nWait for Smartconfig..."); // 打印log信息
  WiFi.beginSmartConfig();                       // 开始SmartConfig，等待手机端发出用户名和密码
  while (1)
  {
    Serial.print(".");
    delay(100);                 // wait for a second
    if (WiFi.smartConfigDone()) // 配网成功，接收到SSID和密码
    {
      Serial.println("SmartConfig Success");
      Serial.printf("SSID:%s\r\n", WiFi.SSID().c_str());
      Serial.printf("PSW:%s\r\n", WiFi.psk().c_str());
      break;
    }
  }
  loadNum = 194;
}
#endif

// 参考一下这位博主的函数输出函数
// 作者：济南凡事
// 链接：https://www.jianshu.com/p/7cef8e7b22d1
// 来源：简书
// 著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。
void ledcAnalogWrite(uint8_t channel, uint32_t value)
{

  uint32_t valueMax = 255;
  // calculate duty, 8191 from 2 ^ 13 - 1

  uint32_t duty = (8191 / valueMax) * min(value, valueMax);

  // write duty to LEDC

  ledcWrite(channel, duty);
}

String SMOD = ""; // 0亮度
bool isBlueT = 0;

// 串口调试设置函数
void Serial_set()
{
  String incomingByte = "";
  if (Serial.available() > 0)
  { // 增加蓝牙串口功能

    // 串口
    if (Serial.available() > 0)
    {
      while (Serial.available() > 0) // 监测串口缓存，当有数据输入时，循环赋值给incomingByte
      {
        if (iscntrl(Serial.peek()))
          Serial.read();
        else
          incomingByte += char(Serial.read()); // 读取单个字符值，转换为字符，并按顺序一个个赋值给incomingByte
        delay(2);                              // 不能省略，因为读取缓冲区数据需要时间
      }
      isBlueT = 0;
    }

    if (SMOD == "0x01") // 设置1亮度设置
    {
      int LCDBL = atoi(incomingByte.c_str()); // int n = atoi(xxx.c_str());//String转int
      if (LCDBL >= 0 && LCDBL <= 255)
      {
        EEPROM.write(BL_addr, LCDBL); // 亮度地址写入亮度值
        EEPROM.commit();              // 保存更改的数据
        delay(5);
        LCD_BL_PWM = EEPROM.read(BL_addr);
        delay(5);
        SMOD = "";
        Serial.print("亮度调整为：");
        // analogWrite(LCD_BL_PIN, 1023 - (LCD_BL_PWM*10));
        ledcAnalogWrite(pwm_channel0, LCD_BL_PWM);
        Serial.println(LCD_BL_PWM);
        Serial.println("");
      }
      else
        Serial.println("亮度调整错误，请输入0-255");
    }
    if (SMOD == "0x02") // 设置2地址设置
    {
      unsigned int CityCODE = 0;
      unsigned int CityC = atoi(incomingByte.c_str());  // int n = atoi(xxx.c_str());//String转int
      CityC = (CityC == 101281001) ? 101281009 : CityC; // 湛江的代码改为霞山代码，解决湛江的代码取不到其他区的预警信号
      if (CityC >= 101000000 && CityC <= 102000000 || CityC == 0)
      {
        for (int cnum = 0; cnum < 5; cnum++)
        {
          EEPROM.write(CC_addr + cnum, CityC % 100); // 城市地址写入城市代码
          EEPROM.commit();                           // 保存更改的数据
          CityC = CityC / 100;
          delay(5);
        }
        for (int cnum = 5; cnum > 0; cnum--)
        {
          CityCODE = CityCODE * 100;
          CityCODE += EEPROM.read(CC_addr + cnum - 1);
          delay(5);
        }

        cityCode = CityCODE;

        if (cityCode == "0")
        {
          Serial.println("城市代码调整为：自动");
          getCityCode(); // 获取城市代码
        }
        else
        {
          Serial.print("城市代码调整为：");
          Serial.println(cityCode);
        }
        UpdateWeater_en = 1;
        weatherWarn.config(HeUserKey, cityCode); // 配置请求信息  101230201厦门 101230201 厦门  101281006 湛江 101281009 霞山
        UpdateScreen = 1;
        // LCD_reflash(1); // 屏幕刷新程序
        SMOD = "";
      }
      else
        Serial.println("城市调整错误，请输入9位城市代码，自动获取请输入0");
    }
    if (SMOD == "0x03") // 设置3屏幕显示方向
    {
      int RoSet = atoi(incomingByte.c_str());
      if (RoSet >= 0 && RoSet <= 3)
      {
        EEPROM.write(Ro_addr, RoSet); // 屏幕方向地址写入方向值
        EEPROM.commit();              // 保存更改的数据
        SMOD = "";
        // 设置屏幕方向后重新刷屏并显示
        tft.setRotation(RoSet);
        tft.fillScreen(0x0000);
        isNewWeather = 1;
        UpdateScreen = 1;

        Serial.print("屏幕方向设置为：");
        Serial.println(RoSet);
      }
      else
      {
        Serial.println("屏幕方向值错误，请输入0-3内的值");
      }
    }
    if (SMOD == "0x04") // 设置天气更新时间
    {
      int wtup = atoi(incomingByte.c_str()); // int n = atoi(xxx.c_str());//String转int
      if (wtup >= 1 && wtup <= 60)
      {
        EEPROM.write(UpWeT_addr, wtup); // 更新时间地址写入更新时间值
        EEPROM.commit();                // 保存更改的数据
        delay(5);
        updateweater_time = EEPROM.read(UpWeT_addr);
        delay(5);
        // updateweater_time = wtup;
        SMOD = "";
        Serial.print("天气更新时间更改为：");
        Serial.print(updateweater_time);
        Serial.println("分钟");
      }
      else
        Serial.println("更新时间太长，请重新设置（1-60）");
    }
    else
    {
      SMOD = incomingByte;
      delay(2);
      if (SMOD == "0x01")
        Serial.println("请输入亮度值，范围0-255");
      else if (SMOD == "0x02")
        Serial.println("请输入9位城市代码，自动获取请输入0");
      else if (SMOD == "0x03")
      {
        Serial.println("请输入屏幕方向值，");
        Serial.println("0-USB接口朝下");
        Serial.println("1-USB接口朝右");
        Serial.println("2-USB接口朝上");
        Serial.println("3-USB接口朝左");
      }
      else if (SMOD == "0x04")
      {
        Serial.print("当前天气更新时间：");
        Serial.print(updateweater_time);
        Serial.println("分钟");
        Serial.println("请输入天气更新时间（1-60）分钟");
      }
      else if (SMOD == "0x05")
      {
        Serial.println("重置WiFi设置中......");
        delay(10);
        wm.resetSettings();
        deletewificonfig();
        delay(10);
        Serial.println("重置WiFi成功");
        SMOD = "";
        ESP.restart();
      }
      else
      {
        Serial.println("");
        Serial.println("请输入需要修改的代码：");
        Serial.println("亮度设置输入        0x01");
        Serial.println("地址设置输入        0x02");
        Serial.println("屏幕方向设置输入    0x03");
        Serial.println("更改天气更新时间    0x04");
        Serial.println("重置WiFi(会重启)    0x05");
        Serial.println("");
      }
    }
  }
}

