hgr2004/ESP32_Weather/src/main.cpp
// 连接wifi后等待获取时间天气等信息显示窗口
void Wait_win(String showStr)
{
  clk.setColorDepth(8);
  clk.loadFont("msyhbd20", FlashFS);
  clk.createSprite(200, 100);                         // 创建窗口
  clk.fillSprite(0x0000);                             // 填充率
  clk.drawRoundRect(0, 0, 200, 16, 8, 0xFFFF);        // 空心圆角矩形
  clk.fillRoundRect(3, 3, loadNum, 10, 5, TFT_GREEN); // 实心圆角矩形
  clk.setTextDatum(CC_DATUM);                         // 设置文本数据
  clk.setTextColor(TFT_GREEN, 0x0000);
  clk.drawString("WiFi连接成功!!!", 100, 40, 2);
  clk.setTextColor(TFT_WHITE, 0x0000);
  clk.drawRightString("初始化...", 180, 60, 2);
  clk.pushSprite(20, 120); // 窗口位置
  clk.deleteSprite();

  clk.createSprite(200, 20);
  clk.fillSprite(0x0000);
  clk.setTextDatum(CC_DATUM);
  clk.setTextColor(TFT_WHITE, 0x0000);
  clk.drawCentreString(showStr, 120, 0, 2);
  clk.pushSprite(20, 100);
  clk.deleteSprite();
  clk.unloadFont();
  loadNum += 1;
  if (loadNum >= 255)
    loadNum = 0;
}

#if WM_EN
// WEB配网LCD显示函数
void Web_win()
{
  clk.setColorDepth(8);

  clk.createSprite(200, 60); // 创建窗口
  clk.fillSprite(0x0000);    // 填充率

  clk.setTextDatum(CC_DATUM); // 设置文本数据
  clk.setTextColor(TFT_GREEN, 0x0000);
  clk.drawString("WiFi Connect Fail!", 100, 10, 2);
  clk.drawString("SSID:", 45, 40, 2);
  clk.setTextColor(TFT_WHITE, 0x0000);
  clk.drawString("WeatherAP_XXXX", 125, 40, 2);
  clk.pushSprite(20, 50); // 窗口位置

  clk.deleteSprite();
}

// WEB配网函数
void Webconfig()
{
  WiFi.mode(WIFI_STA); // explicitly set mode, esp defaults to STA+AP

  delay(3000);
  wm.resetSettings(); // wipe settings

  // add a custom input field
  // int customFieldLength = 40;

  // new (&custom_field) WiFiManagerParameter("customfieldid", "Custom Field Label", "Custom Field Value", customFieldLength,"placeholder=\"Custom Field Placeholder\"");

  // test custom html input type(checkbox)
  //  new (&custom_field) WiFiManagerParameter("customfieldid", "Custom Field Label", "Custom Field Value", customFieldLength,"placeholder=\"Custom Field Placeholder\" type=\"checkbox\""); // custom html type

  // test custom html(radio)
  // const char* custom_radio_str = "<br/><label for='customfieldid'>Custom Field Label</label><input type='radio' name='customfieldid' value='1' checked> One<br><input type='radio' name='customfieldid' value='2'> Two<br><input type='radio' name='customfieldid' value='3'> Three";
  // new (&custom_field) WiFiManagerParameter(custom_radio_str); // custom html input

  const char *set_rotation = "<br/><label for='set_rotation'>Set Rotation</label>\
                              <input type='radio' name='set_rotation' value='0' checked> One<br>\
                              <input type='radio' name='set_rotation' value='1'> Two<br>\
                              <input type='radio' name='set_rotation' value='2'> Three<br>\
                              <input type='radio' name='set_rotation' value='3'> Four<br>";

  WiFiManagerParameter custom_rot(set_rotation); // custom html input
  WiFiManagerParameter custom_bl("LCDBL", "LCD BackLight(1-255)", "230", 3);
#if DHT_EN
  WiFiManagerParameter custom_DHT11("DHT11EN", "Enable DHT11 sensor", "1", 3);
#endif
  WiFiManagerParameter custom_weatertime("WeaterUpdateTime", "Weather Update Time(Min)(1-60)", "20", 3);
  WiFiManagerParameter custom_cc("CityCode", "CityCode", "101281001", 9); // 湛江101281001
  WiFiManagerParameter p_lineBreak_notext("<p></p>");

  // wm.addParameter(&p_lineBreak_notext);
  // wm.addParameter(&custom_field);
  wm.addParameter(&p_lineBreak_notext);
  wm.addParameter(&custom_cc);
  wm.addParameter(&p_lineBreak_notext);
  wm.addParameter(&custom_bl);
  wm.addParameter(&p_lineBreak_notext);
  wm.addParameter(&custom_weatertime);
  wm.addParameter(&p_lineBreak_notext);
  wm.addParameter(&custom_rot);
#if DHT_EN
  wm.addParameter(&p_lineBreak_notext);
  wm.addParameter(&custom_DHT11);
#endif
  wm.setSaveParamsCallback(saveParamCallback);
  wm.setSaveConfigCallback(SaveConfigCallback);
  // custom menu via array or vector
  //
  // menu tokens, "wifi","wifinoscan","info","param","close","sep","erase","restart","exit" (sep is seperator) (if param is in menu, params will not show up in wifi page!)
  // const char* menu[] = {"wifi","info","param","sep","restart","exit"};
  // wm.setMenu(menu,6);
  std::vector<const char *> menu = {"wifi", "restart"};

  wm.setMenu(menu);

  // set dark theme
  wm.setClass("invert");

  // set static ip
  //  wm.setSTAStaticIPConfig(IPAddress(10,0,1,99), IPAddress(10,0,1,1), IPAddress(255,255,255,0)); // set static ip,gw,sn
  //  wm.setShowStaticFields(true); // force show static ip fields
  //  wm.setShowDnsFields(true);    // force show dns field always

  wm.setConnectTimeout(60);       // how long to try to connect for before continuing
  wm.setConfigPortalTimeout(120); // auto close configportal after n seconds
  // wm.setCaptivePortalEnable(false); // disable captive portal redirection
  // wm.setAPClientCheck(true); // avoid timeout if client connected to softap

  // wifi scan settings
  // wm.setRemoveDuplicateAPs(false); // do not remove duplicate ap names (true)
  wm.setMinimumSignalQuality(20); // set min RSSI (percentage) to show in scans, null = 8%
  // wm.setShowInfoErase(false);      // do not show erase button on info page
  // wm.setScanDispPerc(true);       // show RSSI as percentage not graph icons

  // wm.setBreakAfterConfig(true);   // always exit configportal even if wifi save fails

  bool res;
  // res = wm.autoConnect(); // auto generated AP name from chipid
  uint64_t chipid;
  chipid = ESP.getEfuseMac(); // The chip ID is essentially its MAC address(length: 6 bytes).
  String StrSSID = "WeatherAP_" + String((unsigned long)(uint16_t)chipid, HEX);

  res = wm.autoConnect(StrSSID.c_str()); // anonymous ap
                                         // res = wm.autoConnect("AutoConnectAP" + String((uint32_t)ESP.getEfuseMac())); // anonymous ap
  //  res = wm.autoConnect("AutoConnectAP","password"); // password protected ap

  while (!res)
  {
    wm.process(); // avoid delays() in loop when non-blocking and other long running code
  }
}

String getParam(String name)
{
  // read parameter from server, for customhmtl input
  String value;
  if (wm.server->hasArg(name))
  {
    value = wm.server->arg(name);
  }
  return value;
}

void saveParamCallback()
{
  int CCODE = 0, cc;

  Serial.println("[CALLBACK] saveParamCallback fired");

// 将从页面中获取的数据保存
#if DHT_EN
  DHT_img_flag = getParam("DHT11EN").toInt();
#endif
  updateweater_time = getParam("WeaterUpdateTime").toInt();
  cc = getParam("CityCode").toInt();
  LCD_Rotation = getParam("set_rotation").toInt();
  LCD_BL_PWM = getParam("LCDBL").toInt();

  // 对获取的数据进行处理
  // 城市代码
  Serial.print("CityCode = ");
  Serial.println(cc);
  cc = (cc == 101281001) ? 101281009 : cc; // 湛江的代码改为霞山代码，解决湛江的代码取不到其他区的预警信号
  if (cc >= 101000000 && cc <= 102000000 || cc == 0)
  {
    for (int cnum = 0; cnum < 5; cnum++)
    {
      EEPROM.write(CC_addr + cnum, cc % 100); // 城市地址写入城市代码
      EEPROM.commit();                        // 保存更改的数据
      cc = cc / 100;
      delay(5);
    }
    for (int cnum = 5; cnum > 0; cnum--)
    {
      CCODE = CCODE * 100;
      CCODE += EEPROM.read(CC_addr + cnum - 1);
      delay(5);
    }
    cityCode = CCODE;
  }
  // 屏幕方向
  Serial.print("LCD_Rotation = ");
  Serial.println(LCD_Rotation);
  if (EEPROM.read(Ro_addr) != LCD_Rotation)
  {
    EEPROM.write(Ro_addr, LCD_Rotation);
    EEPROM.commit();
    delay(5);
  }
  tft.setRotation(LCD_Rotation);
  tft.fillScreen(0x0000);
  Web_win();
  loadNum--;
  loading(1);
  if (EEPROM.read(BL_addr) != LCD_BL_PWM)
  {
    EEPROM.write(BL_addr, LCD_BL_PWM);
    EEPROM.commit();
    delay(5);
  }
  if (EEPROM.read(UpWeT_addr) != updateweater_time)
  {
    EEPROM.write(UpWeT_addr, updateweater_time);
    EEPROM.commit();
    delay(5);
  }
  // 屏幕亮度
  Serial.print("亮度调整为：");
  ledcAnalogWrite(pwm_channel0, LCD_BL_PWM);
  Serial.println(LCD_BL_PWM);
  // 天气更新时间
  Serial.print("天气更新时间调整为：");
  Serial.println(updateweater_time);

#if DHT_EN
  // 是否使用DHT11传感器
  Serial.print("DHT11传感器：");
  EEPROM.write(DHT_addr, DHT_img_flag);
  EEPROM.commit(); // 保存更改的数据
  Serial.println((DHT_img_flag ? "已启用" : "未启用"));
#endif
}
// web配网成功后保存回调函数
void SaveConfigCallback()
{
  if (WiFi.status() == WL_CONNECTED)
  {
    Serial.print("SSID:");
    Serial.println(WiFi.SSID().c_str());
    Serial.print("PSW:");
    Serial.println("************");
    strcpy(wificonf.stassid, WiFi.SSID().c_str()); // 名称复制
    strcpy(wificonf.stapsw, WiFi.psk().c_str());   // 密码复制
    savewificonfig();
    readwificonfig();
  }
}
#endif

void LCD_reflash(bool en)
{
  // 更新天气情况和预警情况
  if (UpdateWeater_en == 1)
  {
    if (WiFi.status() == WL_CONNECTED)
    {
      Serial.println("开始更新天气...");

      getCityWeater();
      getWarning(); // 取当前预警

      if (UpdateWeater_en == 1)
        UpdateWeater_en = 0;
    }
  }

