hgr2004/ESP32_Weather/src/main.cpp
  // 更新农历情况
  if (UpdateNL_en == 1)
  {
    if (WiFi.status() == WL_CONNECTED)
    {
      Serial.println("开始更新万年历...");
      getNongli();
      if (UpdateNL_en == 1)
        UpdateNL_en = 0;
    }
  }

  // 20分钟更新一次天气
  if (millis() - weaterTime > (60000 * updateweater_time))
  {
    UpdateWeater_en = 1;
    weaterTime = millis();
  }

  // 每3小时更新一下农历信息
  if (rtc.getHour(true) % 3 == 0)
  {
    if (!finishNL)
    {
      UpdateNL_en = 1;
    }
    else
    {
      UpdateNL_en = 0;
    }
  }
  else
  {
    UpdateNL_en = 0;
  }
  // UpdateScreen = 2;
}

void drawTemIcons()
{
  TJpgDec.drawJpg(31, 183, temperature, sizeof(temperature)); // 温度图标
  TJpgDec.drawJpg(50, 200, humidity, sizeof(humidity));       // 湿度图标
}
// 滚动显示两个字幕
void dispScrolls()
{
  /***********************************************************************************************************
   * 做一个双状态切换  1 -> 3
   *                    X
   *                 2  -> 4
   *    1显示scrollDate  2显示scrollBanner    显示完后：1切到3  2切到4   定时到后：3切到2  4切到1  实现定时切换轮播*
   ************************************************************************************************************/

  // 滚动显示天气情况和黄历
  switch (prevTime)
  {
  case 1:
    scrollDate();
    prevTime = 3;
    break;
  case 2:
    scrollBanner();
    prevTime = 4;
    break;
  default:
    break;
  }

  //  定时器计数 用来定时滚动显示 秒 1.5S切换
  if (updateTime > 15)
  {
    updateTime = 0;

    switch (prevTime)
    {
    case 3:
      prevTime = 2;
      break;
    case 4:
      prevTime = 1;
      break;

    default:
      break;
    }
  }
}

// 取得和风天气的预警信息
void getWarning()
{
  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println("getWarning Error:WiFi is not Connected.");
    LostWiFi = true;
    // WiFi.reconnect();
    return;
  }
  else
  {
    LostWiFi = false;
  }
  isNewWarn = false;
  scrollText[6] = "";

  if (weatherWarn.get())
  {
    if (weatherWarn.getStatus().equals("update") || weatherWarn.getStatus().equals("active"))
    {
      String T = weatherWarn.getTitle();
      int StrIndex = T.indexOf("布");
      int StrEnd = T.indexOf("信号");
      scrollText[6] = T.substring(StrIndex + 3, StrEnd);
      isNewWarn = true;
    }
    else
    {
      isNewWarn = false;
      scrollText[6] = "";
    }
  }
  else
  {
    Serial.println("Update Failed...");
    Serial.print("Server Response: ");
    Serial.println(weatherWarn.getServerCode());
    scrollText[6] = "";
    isNewWarn = false;
  }
}

// 显示天气预警界面
void DispWarn()
{
  String T = weatherWarn.getTitle();
  String X = weatherWarn.getWeatherText();

  if (T.isEmpty() || X.isEmpty())
  {
    Serial.println("warning is Empty!");
    return;
  }

  int StrIndex = T.indexOf("布");
  String temp1 = T.substring(0, StrIndex - 3);
  String temp2 = T.substring(StrIndex + 3);
  String sColor = weatherWarn.getColor();

  if (sColor.equals("White"))
    tft.fillScreen(TFT_LIGHTGREY);
  else if (sColor.equals("Blue"))
    tft.fillScreen(TFT_BLUE);
  else if (sColor.equals("Green"))
    tft.fillScreen(TFT_GREEN);
  else if (sColor.equals("Yellow"))
    tft.fillScreen(TFT_YELLOW);
  else if (sColor.equals("Orange"))
    tft.fillScreen(TFT_ORANGE);
  else if (sColor.equals("Red"))
    tft.fillScreen(TFT_RED);
  else if (sColor.equals("Black"))
    tft.fillScreen(TFT_BLACK);
  else
    tft.fillScreen(TFT_SILVER);

  String typeFile = "/png/" + String(weatherWarn.getType(), DEC) + ".jpg";

  // 防止出现不明的警号代码
  if (!FlashFS.exists(typeFile))
  {
    typeFile = "/png/9999.jpg";
  }

  TJpgDec.setCallback(tft_output_Warn);
  TJpgDec.drawFsJpg(80, 10, typeFile, FlashFS);
  TJpgDec.setCallback(tft_output);
  tft.drawRoundRect(80, 10, 80, 80, 5, TFT_BLACK);
  tft.drawRoundRect(80 + 1, 10 + 1, 80 - 2, 80 - 2, 5, TFT_BLACK);
  tft.drawRoundRect(80 + 2, 10 + 2, 80 - 4, 80 - 4, 5, TFT_BLACK);

  clk.setColorDepth(8);
  clk.loadFont("msyhbd20", FlashFS);
  clk.createSprite(220, 26 * 2);
  clk.fillSprite(TFT_PINK);
  clk.setTextWrap(false);
  clk.setTextDatum(TL_DATUM);
  clk.setTextColor(TFT_NAVY, TFT_PINK);

  clk.drawCentreString(temp2, 110, 3, 2);
  clk.drawCentreString(temp1, 110, 30, 2);

  clk.pushSprite(10, 162);
  clk.deleteSprite();

  clk.createSprite(230, 22 * 3);
  clk.fillSprite(TFT_WHITE);
  clk.setTextWrap(true);
  clk.setTextDatum(BL_DATUM);
  clk.setTextColor(TFT_BLACK, TFT_WHITE);

  int iCounter = 10 * X.length() / (12 * 2) - 30;

  for (int i = 0; i < iCounter; i++)
  {
    clk.fillSprite(TFT_WHITE);
    clk.drawString(X, 2, 60 - i * 2);
    clk.pushSprite(5, 90);

    // Continuous elliptical arc drawing
    fillArc(120, 120, inc * 6, 1, 120, 120, 5, rainbow(col));
    inc++;
    col += 1;
    if (col > 191)
      col = 0;
    if (inc > 59)
      inc = 0;

    delay(LOOP_DELAY);
  }

  // clk.pushSprite(10, 140);
  clk.deleteSprite();
  clk.unloadFont();

  matrix_effect.setTextAnimMode(AnimMode::SHOWCASE, "\n\r Weather Warning!!!       \n\r...气象警告!!!注意安全...        \n\r", 15, 120, 280);
  const long period = 22000;              // period at which to blink in ms
  unsigned long currentMillis = millis(); // store the current time
  tft.loadFont(ztqFont_20);
  do
  {
    matrix_effect.loop();
  } while (millis() - currentMillis <= period); // check if 1000ms passed
  tft.unloadFont();
  delay(10);
  tft.fillScreen(TFT_BLACK);
}

// 发送HTTP请求并且将服务器响应通过串口输出
void getCityCode()
{
  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println("getCitycode Error:WiFi is not Connected.");
    LostWiFi = true;
    // WiFi.reconnect();
    return;
  }
  else
  {
    LostWiFi = false;
  }

  String URL = "http://wgeo.weather.com.cn/ip/?_=" + String(rtc.getEpoch());
  // 创建 HTTPClient 对象
  HTTPClient httpClient; // 定义http客户端

  // 配置请求地址。此处也可以不使用端口号和PATH而单纯的
  httpClient.begin(wificlient, URL);

  // 设置请求头中的User-Agent
  httpClient.setUserAgent("Mozilla/5.0 (iPhone; CPU iPhone OS 11_0 like Mac OS X) AppleWebKit/604.1.38 (KHTML, like Gecko) Version/11.0 Mobile/15A372 Safari/604.1");
  httpClient.addHeader("Referer", "http://www.weather.com.cn/");

  // 启动连接并发送HTTP请求
  int httpCode = httpClient.GET();
  Serial.print("Send GET request to URL: ");

  // 重试
  while (httpCode == -1 || httpCode == -11)
  {
    httpCode = httpClient.GET();
  }

  // 如果服务器响应OK则从服务器获取响应体信息并通过串口输出
  if (httpCode == HTTP_CODE_OK)
  {
    String str = httpClient.getString();

    int aa = str.indexOf("id=");
    if (aa > -1)
    {
      unsigned int CityCODE = 0;
      // cityCode = str.substring(aa+4,aa+4+9).toInt();
      unsigned int CityC = str.substring(aa + 4, aa + 4 + 9).toInt();
      Serial.println("CityCode:" + cityCode);

      if (CityC >= 101000000 && CityC <= 102000000 || CityC == 0)
      {
        for (int cnum = 0; cnum < 5; cnum++)
        {
          EEPROM.write(CC_addr + cnum, CityC % 100); // 城市地址写入城市代码
          EEPROM.commit();                           // 保存更改的数据
          CityC = CityC / 100;
          delay(5);
        }
        for (int cnum = 5; cnum > 0; cnum--)
        {
          CityCODE = CityCODE * 100;
          CityCODE += EEPROM.read(CC_addr + cnum - 1);
          delay(5);
        }

