hgr2004/ESP32_Weather/src/main.cpp
        cityCode = CityCODE;
      }
      else
      {
        Serial.println("城市代码格式错误，获取城市代码失败");
      }
    }
    else
    {
      Serial.println("获取城市代码失败");
    }
  }
  else
  {
    Serial.println("请求城市代码错误：");
  }

  // 关闭ESP8266与服务器连接
  httpClient.end();
}

// 获取城市天气
void getCityWeater()
{
  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println("getCitycode Error:WiFi is not Connected.");
    LostWiFi = true;
    // WiFi.reconnect();
    return;
  }
  else
  {
    LostWiFi = false;
  }

  String jsonCityDZ = "";
  String jsonDataSK = "";
  String jsonFC = "";

  String URL = "http://d1.weather.com.cn/weather_index/" + cityCode + ".html?_=" + String(rtc.getEpoch());

  // 创建 HTTPClient 对象
  HTTPClient httpClient; // 定义http客户端

  httpClient.begin(URL);

  // 设置请求头中的User-Agent
  httpClient.setUserAgent("Mozilla/5.0 (iPhone; CPU iPhone OS 11_0 like Mac OS X) AppleWebKit/604.1.38 (KHTML, like Gecko) Version/11.0 Mobile/15A372 Safari/604.1");
  httpClient.addHeader("Referer", "http://www.weather.com.cn/");

  // 启动连接并发送HTTP请求
  int httpCode = httpClient.GET();
  Serial.println("正在获取天气数据");

  // 重试
  while (httpCode == -1 || httpCode == -11)
  {
    httpCode = httpClient.GET();
    delay(1000);
  }

  // 如果服务器响应OK则从服务器获取响应体信息并通过串口输出
  if (httpCode == HTTP_CODE_OK)
  {

    String str = httpClient.getString();
    int indexStart = str.indexOf("weatherinfo\":");
    int indexEnd = str.indexOf("};var alarmDZ");

    jsonCityDZ = str.substring(indexStart + 13, indexEnd);

    indexStart = str.indexOf("dataSK =");
    indexEnd = str.indexOf(";var dataZS");
    jsonDataSK = str.substring(indexStart + 8, indexEnd);

    indexStart = str.indexOf("\"f\":[");
    indexEnd = str.indexOf(",{\"fa");
    jsonFC = str.substring(indexStart + 5, indexEnd);

    isNewWeather = 1;
    Serial.println("获取成功");

    // 解析第一段JSON
    DynamicJsonDocument doc(1024);
    deserializeJson(doc, jsonDataSK);
    JsonObject sk = doc.as<JsonObject>();

    tempnum = sk["temp"].as<int>();                                  // 温度
    huminum = atoi((sk["SD"].as<String>()).substring(0, 2).c_str()); // 湿度
    // 霞山的霞字在字库里面没有，所以调整为湛江 ：）
    cityname = sk["cityname"].as<String>();
    cityname = cityname.equals("霞山") ? "湛江" : cityname;

    pm25V = sk["aqi"];

    scrollText[0] = "实时天气 " + sk["weather"].as<String>();
    // scrollText[1] = "空气质量 " + aqiTxt;
    scrollText[2] = "风向 " + sk["WD"].as<String>() + sk["WS"].as<String>();
    Iconsname = atoi((sk["weathercode"].as<String>()).substring(1, 3).c_str());

    // 左上角滚动字幕
    // 解析第二段JSON
    deserializeJson(doc, jsonCityDZ);
    JsonObject dz = doc.as<JsonObject>();

    scrollText[3] = "今日" + dz["weather"].as<String>();

    deserializeJson(doc, jsonFC);
    JsonObject fc = doc.as<JsonObject>();

    scrollText[4] = "最低温度" + fc["fd"].as<String>() + "℃";
    scrollText[5] = "最高温度" + fc["fc"].as<String>() + "℃";
  }
  else
  {
    Serial.print("请求城市天气错误：");
    isNewWeather = 1;
    jsonCityDZ = "{\"city\":\"湛江\",\"cityname\":\"zhanjiang\",\"temp\":\"999\",\"tempn\":\"29\",\"weather\":\"等待更新\",\"wd\":\"等待更新\",\"ws\":\"等待更新\",\"weathercode\":\"d1\",\"weathercoden\":\"n3\",\"fctime\":\"202306220800\"}";
    jsonDataSK = "{\"nameen\":\"zhanjiang\",\"cityname\":\"湛江\",\"city\":\"101281001\",\"temp\":\"00\",\"tempf\":\"00\",\"WD\":\"等待更新\",\"wde\":\"NW\",\"WS\":\"等待更新\",\"wse\":\"4km/h\",\"SD\":\"00%\",\"sd\":\"00%\",\"qy\":\"997\",\"njd\":\"13km\",\"time\":\"18:55\",\"rain\":\"0\",\"rain24h\":\"0\",\"aqi\":\"38\",\"aqi_pm25\":\"38\",\"weather\":\"等待更新\",\"weathere\":\"Cloudy\",\"weathercode\":\"d01\",\"limitnumber\":\"\",\"date\":\"等待更新\"}";
    jsonFC = "{\"fa\":\"01\",\"fb\":\"03\",\"fc\":\"34\",\"fd\":\"27\",\"fe\":\"等待更新\",\"ff\":\"等待更新\",\"fg\":\"等待更新\",\"fh\":\"等待更新\",\"fk\":\"5\",\"fl\":\"0\",\"fm\":\"999.9\",\"fn\":\"88.9\",\"fi\":\"6/22\",\"fj\":\"今天\"}";
  }
  // 关闭ESP8266与服务器连接
  httpClient.end();
}

//  获取农历信息
void getNongli()
{
  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println("getCitycode Error:WiFi is not Connected.");
    LostWiFi = true;
    // WiFi.reconnect();
    return;
  }
  else
  {
    LostWiFi = false;
  }

  Serial.println("获取农历信息．．．");
  DynamicJsonDocument doc(1024);

  TotalHEAD = 4;
  scrolHEAD = new Display[TotalHEAD];

  if (scrolHEAD == NULL)
  {
    Serial.println("new scrolHEAD fail!!");
    return;
  }

  if (scrollNongLi != NULL)
    delete[] scrollNongLi;
  scrollNongLi = new Display[1];
  if (scrollNongLi == NULL)
  {
    Serial.println("new scrollNongLi fail!!");
    return;
  }
  memset(scrollNongLi, '\0', 1);

  String Y = String(rtc.getYear());
  String M = rtc.getMonth() + 1 < 10 ? "0" + String(rtc.getMonth() + 1) : String(rtc.getMonth() + 1);
  String D = rtc.getDay() < 10 ? "0" + String(rtc.getDay()) : String(rtc.getDay());

  memset(scrolHEAD, '\0', TotalHEAD);

  scrollNongLi[0].title = scrolHEAD[0].title = monthDay() + " " + week();
  scrollNongLi[0].color = scrolHEAD[0].color = cWHITE;

  // https://www.mxnzp.com/api/holiday/single/20181121?ignoreHoliday=false&app_id=不再提供请自主申请&app_secret=不再提供请自主申请
  String URL = "https://www.mxnzp.com/api/holiday/single/" + Y + M + D + "?ignoreHoliday=false&app_id=" + mx_id + "&app_secret=" + mx_secret;

  // 创建 HTTPClient 对象
  HTTPClient httpClient; // 定义http客户端

  WiFiClientSecure *client = new WiFiClientSecure;

  if (!client)
  {
    Serial.println("Unable to create client");
    if (scrollNongLi != NULL)
      delete[] scrollNongLi;
    if (scrolHEAD != NULL)
      delete[] scrolHEAD;
    return;
  }

  client->setInsecure();
  httpClient.begin(*client, URL);

  const char *headerKeys[] = {"Connection", "Content-Encoding", "Content-Type", "Date", "Server", "Transfer-Encoding", "Vary"};
  const size_t numberOfHeaders = 7;
  httpClient.collectHeaders(headerKeys, numberOfHeaders);
  // 设置请求头中的User-Agent
  httpClient.setUserAgent("Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:109.0) Gecko/20100101 Firefox/114.0");
  httpClient.addHeader("Accept", "text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,*/*;q=0.8");
  httpClient.addHeader("Accept-Encoding", "gzip, deflate, br");
  httpClient.addHeader("Accept-Language", "zh-CN,zh;q=0.8,zh-TW;q=0.7,zh-HK;q=0.5,en-US;q=0.3,en;q=0.2");
  httpClient.addHeader("Host", "https://www.mxnzp.com/");
  httpClient.addHeader("Connection", "keep-alive");
  httpClient.addHeader("Sec-Fetch-Dest", "document");
  httpClient.addHeader("Sec-Fetch-Mode", "navigate");
  httpClient.addHeader("Sec-Fetch-Site", "none");
  httpClient.addHeader("Sec-Fetch-User", "?1");
  httpClient.addHeader("Upgrade-Insecure-Requests", "1");

  // 重试次数
  int httpCode = 0;
  int iRetry = 1;

  do
  {
    // 启动连接并发送HTTP请求
    httpCode = httpClient.GET();

