hgr2004/ESP32_Weather/src/main.cpp
    if (httpCode == HTTP_CODE_OK)
    {
      break;
    }
    else
    {
      delay(3000);
    }
    iRetry++;
  } while (!(httpCode == HTTP_CODE_OK) && iRetry < 10);

  // 如果服务器响应OK则从服务器获取响应体信息并通过串口输出
  if (httpCode == HTTP_CODE_OK)
  {
    String response = "";
    int content_len = httpClient.getSize(); // get length of document (is -1 when Server sends no Content-Length header)
    if ((httpClient.hasHeader("Content-Encoding")) && (httpClient.header("Content-Encoding").equals("gzip")))
    {
      Serial.println("httpget() ok");
      WiFiClient *streamptr = httpClient.getStreamPtr();
      Serial.println("getStreamPtr() ok");
      // Gzip解压
      if (streamptr != nullptr)
      {
        Serial.println("streamptr ok");
        TarGzUnpacker *TARGZUnpacker = new TarGzUnpacker();
        Serial.println("TARGZUnpacker ok");

        TARGZUnpacker->haltOnError(true);                                                            // stop on fail (manual restart/reset required)
        TARGZUnpacker->setTarVerify(true);                                                           // true = enables health checks but slows down the overall process
        TARGZUnpacker->setupFSCallbacks(targzTotalBytesFn, targzFreeBytesFn);                        // prevent the partition from exploding, recommended
        TARGZUnpacker->setGzProgressCallback(BaseUnpacker::defaultProgressCallback);                 // targzNullProgressCallback or defaultProgressCallback
        TARGZUnpacker->setLoggerCallback(BaseUnpacker::targzPrintLoggerCallback);                    // gz log verbosity
        TARGZUnpacker->setTarProgressCallback(BaseUnpacker::defaultProgressCallback);                // prints the untarring progress for each individual file
        TARGZUnpacker->setTarStatusProgressCallback(BaseUnpacker::defaultTarStatusProgressCallback); // print the filenames as they're expanded
        TARGZUnpacker->setTarMessageCallback(BaseUnpacker::targzPrintLoggerCallback);                // tar log verbosity

        Serial.println("settings ok");

        if (!TARGZUnpacker->tarGzStreamExpander(streamptr, tarGzFS))
        {
          Serial.printf("tarGzStreamExpander failed with return code #%d\n", TARGZUnpacker->tarGzGetError());
        }
        else
        {
          // print leftover bytes if any (probably zero-fill from the server)
          while (httpClient.connected())
          {
            size_t streamSize = streamptr->available();
            if (streamSize)
            {
              response += streamptr->read();
            }
            else
              break;
          }
        }
        delete TARGZUnpacker;
      }
      else
      {
        Serial.println("Failed to establish http connection");
      }
    }
    else
    {
      response = httpClient.getString();
    }
    // http结束

    // 开始JSON解析
    //  反序列化JSON
    DeserializationError error = deserializeJson(doc, response);

    if (error)
    {
      Serial.print(F("deserializeJson() failed: "));
      Serial.println(error.f_str());
      if (scrollNongLi != NULL)
        delete[] scrollNongLi;
      if (scrolHEAD != NULL)
        delete[] scrolHEAD;
      return;
    }
    JsonObject root = doc.as<JsonObject>();

    if (doc["code"].as<int>() != 1)
    {
      Serial.print(F("data is  wrong: "));
      Serial.println(doc["code"].as<int>());
      if (scrollNongLi != NULL)
        delete[] scrollNongLi;
      if (scrolHEAD != NULL)
        delete[] scrolHEAD;
      return;
    }

    JsonObject data = root["data"];

    const char *suit = data["suit"];   // 今日宜
    const char *avoid = data["avoid"]; // 今日忌

    scrolHEAD[1].title = data["yearTips"].as<String>() + "年 " + data["lunarCalendar"].as<String>();
    scrolHEAD[1].color = cWHITE;
    scrolHEAD[2].title = data["chineseZodiac"].as<String>() + "年" + data["weekOfYear"].as<String>() + "周" + " " + data["typeDes"].as<String>();
    scrolHEAD[2].color = cWHITE;
    scrolHEAD[3].title = "今日" + data["solarTerms"].as<String>();
    scrolHEAD[3].color = cWHITE;

    // 宜忌有时描述太长，分行显示
    String *rword = NULL;
    int needle = 0;

    rword = new String[strlen(suit)];
    if (rword == NULL)
    {
      Serial.println("new rword fail!!");
      return;
    }
    memset(rword, '\0', sizeof(rword));

    // temp = suit;
    if (strlen(suit) > 0)
    {
      TotalYI = StrSplit(suit, ".", rword);

      scrollYI = new Display[TotalYI];
      if (scrollYI == NULL)
      {
        Serial.println("new scrollYI fail!!");
        return;
      }
      memset(scrollYI, '\0', TotalYI);

      if (TotalYI < MaxScroll)
      {
        for (int i = 0; i < TotalYI; i += 2)
        {
          scrollYI[needle].title = "宜:" + rword[i] + " " + rword[i + 1];
          scrollYI[needle].color = cGREEN;
          needle++;
          if (needle > MaxScroll)
            break;
        }
      }
      else
      {
        Serial.println("suit字符串太大。");
      }
    }
    else
    {
      scrollYI[needle].title = "宜:";
      scrollYI[needle].color = cWHITE;
      needle++;
    }
    TotalYI = needle;
    needle = 0;

    if (rword != NULL)
      delete[] rword;

    rword = new String[strlen(avoid)];
    if (rword == NULL)
    {
      Serial.println("new rword fail!!");
      return;
    }
    memset(rword, '\0', sizeof(rword));
    if (strlen(avoid) > 0)
    {
      TotalJI = StrSplit(avoid, ".", rword);

      scrollJI = new Display[TotalJI];
      if (scrollJI == NULL)
      {
        Serial.println("new scrollJI fail!!");
        return;
      }
      memset(scrollJI, '\0', TotalJI);

      if (TotalJI < MaxScroll)
      {
        for (int i = 0; i < TotalJI; i += 2)
        {
          scrollJI[needle].title = "忌:" + rword[i] + " " + rword[i + 1];
          scrollJI[needle].color = cRED;
          needle++;
          if (needle > MaxScroll)
            break;
        }
      }
      else
      {
        Serial.println("avoid字符串太大。");
      }
    }
    else
    {
      scrollJI[needle].title = "忌:";
      scrollJI[needle].color = cRED;
      needle++;
    }
    TotalJI = needle;
    if (rword != NULL)
      delete[] rword;

    if (scrollNongLi != NULL)
      delete[] scrollNongLi;

    TotalDis = TotalHEAD + TotalYI + TotalJI;
    scrollNongLi = new Display[TotalDis];
    if (scrollNongLi == NULL)
    {
      Serial.println("new scrollNongLi fail!!");
      return;
    }
    memset(scrollNongLi, '\0', TotalDis);

    my_strcat_arrcy(scrolHEAD, TotalHEAD, scrollYI, TotalYI, scrollJI, TotalJI, scrollNongLi);

    if (scrollJI != NULL)
      delete[] scrollJI;
    if (scrollYI != NULL)
      delete[] scrollYI;

    finishNL = true;
  }
  else
  {
    if (scrollNongLi != NULL)
      delete[] scrollNongLi;

    TotalDis = TotalHEAD = 1;
    scrollNongLi = new Display[TotalDis];
    if (scrollNongLi == NULL)
    {
      Serial.println("new scrollNongLi fail!!");
      return;
    }
    memset(scrollNongLi, '\0', TotalDis);

    for (int i = 0; i < TotalDis; i++)
    {
      scrollNongLi[i] = scrolHEAD[i];
    }

