hgr2004/ESP32_Weather/src/main.cpp
    Serial.print("请求农历信息错误：");

    finishNL = false;
  }

  if (scrolHEAD != NULL)
    delete[] scrolHEAD;

  // 关闭ESP8266与服务器连接
  httpClient.end();
  delete client;
}

/**
 * 功能：HTTPS请求封装！
 * @param host：请求域名（String类型）
 * @param url：请求地址（String类型）
 * @param parameter：请求参数(String类型)(默认""")
 * @param fingerprint：服务器证书指纹 (String类型)(默认""")
 * @param Port：请求端口(int类型)(默认：443)
 * @param Receive_cache：接收缓存(int类型)(默认：1024)
 * @return 成功返回请求的内容(String类型) 失败则返回"0"
 * */
String HTTPS_request(String host, String url, String parameter)
{
  // WiFiClientSecure HTTPS; //建立WiFiClientSecure对象
  WiFiClientSecure *HTTPS; // 网络连接对象。
  delete HTTPS;
  HTTPS = new WiFiClientSecure;
  uint16_t httpsPort = 443; // 连接端口号。
  int32_t TimerOut = 15000;
  uint8_t writeBuffer[500];
  uint16_t Index;
  const uint16_t BufferSize = 8192; // 缓存大小。缓存足够才能保证在WIFI接收间隔期间不会中断。不会有停顿或跳跃感。
  uint16_t BufferIndex;             // 缓存指针。

  if (parameter != "")
    parameter = "?" + parameter;
  String postRequest = (String)("GET ") + url + parameter + " HTTP/1.1\r\n" +
                       "Host: " + host + "\r\n" +
                       "User-Agent: Mozilla/5.0 (iPhone; CPU iPhone OS 13_2_3 like Mac OS X) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/13.0.3 Mobile/15E148 Safari/604.1 Edg/103.0.5060.53" +
                       "\r\n\r\n";
  HTTPS->setInsecure();        // 不进行服务器身份认证
  HTTPS->setTimeout(TimerOut); // 设置超时。
  int cache = sizeof(postRequest) + 10;
  HTTPS->setTimeout(15000); // 设置等待的最大毫秒数
  Serial.println("初始化参数完毕！\n开始连接服务器==>>>>>");
  HTTPS->connect(host.c_str(), httpsPort, TimerOut);

  Index = 100;
  while (!HTTPS->connected() && Index > 0)
  {
    delay(100);
    Index--;
  }
  if (!HTTPS->connected())
  {
    Serial.println("Connection failed");
    return "failed";
  }
  else
  {
    Serial.println(" connected");
  } // 超过10秒未建立连接则显示连接失败并退出。
  for (Index = 0; Index < postRequest.length(); Index++)
  {
    writeBuffer[Index] = postRequest[Index];
  }
  HTTPS->write(writeBuffer, Index);

  Index = 100;
  BufferIndex = 0;
  postRequest = "";
  while (Index)
  {
    delay(100);
    Index--;
    while (HTTPS->available())
    {
      postRequest = postRequest + char(HTTPS->read());
      BufferIndex++;
      if (BufferIndex > 30)
      {
        // 等待服务器HTTP回应信息。
        if (postRequest[BufferIndex - 1] == '\n' && postRequest[BufferIndex - 2] == '\r' && postRequest[BufferIndex - 3] == '\n' && postRequest[BufferIndex - 4] == '\r')
        {
          Index = 0;
          break;
        }
      }
      if (BufferIndex > BufferSize)
      {
        Index = 0;
        break;
      } // 非HTTP响应，放弃并跳出。
    }
  }

  String line;
  while (HTTPS->connected())
  {
    line = HTTPS->readStringUntil('\n');
    if (line.length() > 10)
      break;
  }
  HTTPS->stop(); // 操作结束，断开服务器连接
  delay(500);
  return line;
}

// 3个数组相加出来1个
void my_strcat_arrcy(Display *arr, int lena, Display *brr, int lenb, Display *crr, int lenc, Display *str)
{
  int i = 0, j = 0;
  for (i = 0; i < lena; i++)
  {
    str[j] = arr[i];
    j++;
  }
  for (i = 0; i < lenb; i++)
  {
    str[j] = brr[i];
    j++;
  }
  for (i = 0; i < lenc; i++)
  {
    str[j] = crr[i];
    j++;
  }
}
// gzip解压进度
void myTarProgressCallback(uint8_t progress)
{
  static int8_t myLastProgress = -1;
  if (myLastProgress != progress)
  {
    myLastProgress = progress;
    if (progress == 0)
    {
      Serial.print("Progress: [0% ");
    }
    else if (progress == 100)
    {
      Serial.println(" 100%]\n");
    }
    else
    {
      switch (progress)
      {
      case 25:
        Serial.print(" 25% ");
        break;
      case 50:
        Serial.print(" 50% ");
        break;
      case 75:
        Serial.print(" 75% ");
        break;
      default:
        Serial.print("T");
        break;
      }
    }
  }
}
// 天气信息写到屏幕上
void weaterData()
{

  /***绘制相关文字***/
  clk.setColorDepth(8);
  clk.loadFont(ZdyLwFont_20); // ZdyLwFont_20

  // 温度
  clk.createSprite(58, 24);
  clk.fillSprite(bgColor);
  clk.setTextDatum(CC_DATUM);
  clk.setTextColor(TFT_WHITE, bgColor);
  // clk.drawString(sk["temp"].as<String>() + "℃", 28, 13);
  clk.drawString(String(tempnum, DEC) + "℃", 28, 13);
  clk.pushSprite(110, 184);
  clk.deleteSprite();
  // tempnum = sk["temp"].as<int>();
  tempnum = tempnum + 10;
  if (tempnum < 10)
    tempcol = 0x00FF;
  else if (tempnum < 28)
    tempcol = 0x0AFF;
  else if (tempnum < 34)
    tempcol = 0x0F0F;
  else if (tempnum < 41)
    tempcol = 0xFF0F;
  else if (tempnum < 49)
    tempcol = 0xF00F;
  else
  {
    tempcol = 0xF00F;
    tempnum = 50;
  }
  tempWin();

  // 湿度
  clk.createSprite(58, 24);
  clk.fillSprite(bgColor);
  clk.setTextDatum(CC_DATUM);
  clk.setTextColor(TFT_WHITE, bgColor);
  clk.drawString(String(huminum, DEC) + '%', 28, 13);
  // clk.drawString("100%",28,13);
  clk.pushSprite(110, 214);
  clk.deleteSprite();

  if (huminum > 90)
    humicol = 0x00FF;
  else if (huminum > 70)
    humicol = 0x0AFF;
  else if (huminum > 40)
    humicol = 0x0F0F;
  else if (huminum > 20)
    humicol = 0xFF0F;
  else
    humicol = 0xF00F;
  humidityWin();

  // 城市名称
  clk.createSprite(94, 30);
  clk.fillSprite(bgColor);
  clk.setTextDatum(CC_DATUM);
  clk.setTextColor(TFT_WHITE, bgColor);

  clk.drawString(cityname, 44, 16);
  clk.pushSprite(26, 15); // 15,15
  clk.deleteSprite();

  // PM2.5空气指数
  uint16_t pm25BgColor = tft.color565(156, 202, 127); // 优
  String aqiTxt = "优";
  // int pm25V = sk["aqi"];
  if (pm25V > 200)
  {
    pm25BgColor = tft.color565(136, 11, 32); // 重度
    aqiTxt = "重度";
  }
  else if (pm25V > 150)
  {
    pm25BgColor = tft.color565(186, 55, 121); // 中度
    aqiTxt = "中度";
  }
  else if (pm25V > 100)
  {
    pm25BgColor = tft.color565(242, 159, 57); // 轻
    aqiTxt = "轻度";
  }
  else if (pm25V > 50)
  {
    pm25BgColor = tft.color565(247, 219, 100); // 良
    aqiTxt = "良";
  }
  clk.createSprite(56, 24);
  clk.fillSprite(bgColor);
  clk.fillRoundRect(0, 0, 50, 24, 4, pm25BgColor);
  clk.setTextDatum(CC_DATUM);
  clk.setTextColor(0x0000);
  clk.drawString(aqiTxt, 25, 13);
  clk.pushSprite(104, 18);
  clk.deleteSprite();

  scrollText[1] = "空气质量 " + aqiTxt;

