hgr2004/ESP32_Weather/src/main.cpp
  clk.unloadFont();
}

// 滚动显示
int currentIndex = 0;
void scrollBanner()
{
  if (scrollText[currentIndex] != "")
  {
    clk.setColorDepth(8);
    scrollText[6].isEmpty() ? clk.loadFont(ZdyLwFont_20) : clk.loadFont("msyhbd20", FlashFS);

    clk.createSprite(150, 30);
    clk.fillSprite(bgColor);
    clk.setTextWrap(false);
    clk.setTextDatum(CC_DATUM);
    scrollText[6].isEmpty() ? clk.setTextColor(TFT_WHITE, bgColor) : clk.setTextColor(TFT_MAGENTA, bgColor);

    clk.drawString(scrollText[currentIndex], 74, 16);

    SmartLocker smartLocker2(&shared_var_mutex_pushSprite, portMAX_DELAY);
    if (smartLocker2.IsLocked())
    {
      clk.pushSprite(10, 45);
    }

    clk.deleteSprite();
    clk.unloadFont();
  }
  if (currentIndex >= 6)
    currentIndex = 0; // 回第一个
  else
    currentIndex += 1; // 准备切换到下一个
}

void scrollDate()
{
  if (scrollNongLi == NULL)
  {
    Serial.println("scrollNongLi is NULL");
    return;
  }
  if (scrollNongLi[CurrentDisDate].title && CurrentDisDate < TotalDis)
  {
    if (scrollNongLi[CurrentDisDate].title != "")
    {

      /***日期****/
      clk.setColorDepth(8);

      // 新的装载字库的方法：
      // 直接先用processing生成xxx.vlw 格式的文件
      // 把xxx.vlw放在platfomio项目下创建的data目录
      // 把vlw文件上传到单片机的flash空间中
      // 然后在这里调用
      clk.loadFont("msyhbd20", FlashFS);
      // 星期
      clk.createSprite(162, 30);
      clk.fillSprite(bgColor);
      clk.setTextDatum(CC_DATUM);
      switch (scrollNongLi[CurrentDisDate].color)
      {
      case cRED:
        clk.setTextColor(0xFDB8, bgColor);
        /* code */
        break;
      case cGREEN:
        clk.setTextColor(TFT_GREEN, bgColor);
        /* code */
        break;
      case cWHITE:
        clk.setTextColor(TFT_WHITE, bgColor);
        /* code */
        break;

      default:
        break;
      }
      clk.drawString(scrollNongLi[CurrentDisDate].title, 75, 16);

      SmartLocker smartLocker2(&shared_var_mutex_pushSprite, portMAX_DELAY);
      if (smartLocker2.IsLocked())
      {
        clk.pushSprite(10, 150);
      }

      clk.deleteSprite();
      clk.unloadFont();
    }
    else
    {
      CurrentDisDate = 0;
      return;
    }

    if (CurrentDisDate >= TotalDis - 1)
    {
      CurrentDisDate = 0; // 回第一个
      return;
    }
    else
    {
      CurrentDisDate += 1; // 准备切换到下一个
      return;
    }
  }
  else
  {
    CurrentDisDate = 0; // 回第一个
    return;
  }
}

#if imgAst_EN
void imgAnim()
{
  int x = 160, y = 160;

  Anim++;
  if (Anim == 10)
    Anim = 0;
  if (LostWiFi)
    TJpgDec.setCallback(tft_output_Anim);
  if (! scrollText[6].isEmpty())
    TJpgDec.setCallback(tft_output_Anim2);

  switch (Anim)
  {
  case 0:
    TJpgDec.drawJpg(x, y, i0, sizeof(i0));
    break;
  case 1:
    TJpgDec.drawJpg(x, y, i1, sizeof(i1));
    break;
  case 2:
    TJpgDec.drawJpg(x, y, i2, sizeof(i2));
    break;
  case 3:
    TJpgDec.drawJpg(x, y, i3, sizeof(i3));
    break;
  case 4:
    TJpgDec.drawJpg(x, y, i4, sizeof(i4));
    break;
  case 5:
    TJpgDec.drawJpg(x, y, i5, sizeof(i5));
    break;
  case 6:
    TJpgDec.drawJpg(x, y, i6, sizeof(i6));
    break;
  case 7:
    TJpgDec.drawJpg(x, y, i7, sizeof(i7));
    break;
  case 8:
    TJpgDec.drawJpg(x, y, i8, sizeof(i8));
    break;
  case 9:
    TJpgDec.drawJpg(x, y, i9, sizeof(i9));
    break;
  default:
    Serial.println("显示Anim错误");
    break;
  }
  if (LostWiFi || !scrollText[6].isEmpty())
    TJpgDec.setCallback(tft_output);
}
#endif

unsigned char Hour_sign = 60;
unsigned char Minute_sign = 60;
unsigned char Second_sign = 60;
void digitalClockDisplay(int reflash_Clock)
{
  // The decoder must be given the exact name of the rendering function above
  int timey = 82;
  if (rtc.getHour(true) != Hour_sign || reflash_Clock == 1) // 时钟刷新
  {
    dig.printfW3660(20 - 10, timey, rtc.getHour(true) / 10);
    dig.printfW3660(60 - 10, timey, rtc.getHour(true) % 10);
    Hour_sign = rtc.getHour(true);
  }
  if (rtc.getMinute() != Minute_sign || reflash_Clock == 1) // 分钟刷新
  {
    dig.printfO3660(101 - 10, timey, rtc.getMinute() / 10);
    dig.printfO3660(141 - 10, timey, rtc.getMinute() % 10);
    Minute_sign = rtc.getMinute();
  }
  if (rtc.getSecond() != Second_sign || reflash_Clock == 1) // 秒钟刷新
  {
    if (DHT_img_flag == 1)
    {
      dig.printfW1830(182 - 10, timey, rtc.getSecond() / 10);
      dig.printfW1830(202 - 10, timey, rtc.getSecond() % 10);
    }
    else
    {
      dig.printfW1830(182 - 10, timey + 30, rtc.getSecond() / 10);
      dig.printfW1830(202 - 10, timey + 30, rtc.getSecond() % 10);
    }

    Second_sign = rtc.getSecond();
  }
  // if (reflash_Clock == 1)
  //   reflash_Clock = 0;
}

// 星期
String week()
{
  String wk[7] = {"日", "一", "二", "三", "四", "五", "六"};
  String s = "周" + wk[rtc.getDayofWeek()];
  return s;
}

// 月日
String monthDay()
{
  String s = String(rtc.getMonth() + 1);
  s = s + "月" + rtc.getDay() + "日";
  return s;
}

/*-------- NTP code ----------*/

time_t getNtpTime()
{
  unsigned long t;
  if (WiFi.status() == WL_CONNECTED)
  {
    // timeClient.update();
    t = timeClient.getEpochTime();
    rtc.setTime(t);
    timeClient.update();
    return t;
  }
  return t;
}

/* **************************************************************************
/* *******************设置显示屏休眠时间***************************************
/* **************************************************************************/

int sethourK = 21; // 几点比如输入01表示1点，13表示13点
int setminK = 00;  // 几分开比如输入05表示5分，22表示22分

int sethourG = 8; // 几点关
int setminG = 30; // 几分关
bool isSleepMode = 0;
int bLight = LCD_BL_PWM;
uint32_t preTime;

/**
 * @brief 设置睡眠时间
 *
 * @param data
 */
void sleepTimeLoop(uint8_t Maxlight, uint8_t Minlight)
{
  uint32_t starttime = sethourK * 100 + setminK; // 开始时间
  uint32_t endtime = sethourG * 100 + setminG;   // 结束时间

  if (starttime == endtime) // 如果开始时间和结束时间是一样的话,就什么都不做
  {
    return;
  }

  uint32_t currtime = rtc.getHour(true) * 100 + rtc.getMinute(); // 当前时间
  if (currtime == preTime)
  {
    return;
  }

  preTime = currtime;
  if (starttime < endtime) // 如果开始时间小于结束时间,则只需要判断当前时间是否在开始时间和结束时间的区间范围内
  {
    if (currtime >= starttime && currtime < endtime) // 如果时间在休眠时间范围内则休眠
    {
      if (!isSleepMode)
      {
        isSleepMode = true; // 标记进入睡眠模式
        bLight = Minlight;  // 调小LED背光
      }
    }
    else
    {
      if (isSleepMode)
      {
        // 这里避免出现误操作,每次都将屏幕点亮,将屏幕亮度设置到预设亮度
        isSleepMode = false; // 标记退出睡眠模式
        bLight = Maxlight;   // 调大LED背光
      }
    }
  }
  else // 如果开始时间大于结束时间,表示表示当前时间在反向的范围内则不需要休眠
  {
    if (currtime >= endtime && currtime < starttime) // 如果时间在休眠时间范围内则休眠
    {
      if (isSleepMode)
      {
        // 这里避免出现误操作,每次都将屏幕点亮,将屏幕亮度设置到预设亮度
        isSleepMode = false; // 标记退出睡眠模式
        bLight = Maxlight;   // 调大LED背光
      }
    }
    else
    {
      if (!isSleepMode)
      {
        isSleepMode = true; // 标记进入睡眠模式
        bLight = Minlight;  // 调小LED背光
      }
    }
  }
  ledcAnalogWrite(pwm_channel0, bLight); // 写入
}

// 创建一个函数，用来根据一个分割符来分割一个字符串
// 入口参数（目标字符串，分割符，返回的结果字符串数组） 返回分割数量
int StrSplit(String str, String fen, String *result)
{
  int index = 0, i = 0;

  if (str.length() == 0)
    return 0;
  do
  {
    index = str.indexOf(fen);
    if (index != -1)
    {
      result[i] = str.substring(0, index);
      str = str.substring(index + fen.length(), str.length());
      i++;
    }
    else
    {
      if (str.length() > 0)
        result[i] = str;
      i++;
    }
  } while (index >= 0);
  // 保证为偶数，便于后面显示
  if (i % 2 != 0)
    result[i] = "";
  return i;
}

// #########################################################################
// Draw a circular or elliptical arc with a defined thickness
// #########################################################################

