hgr2004/ESP32_Weather/src/main.cpp
// x,y == coords of centre of arc
// start_angle = 0 - 359
// seg_count = number of 6 degree segments to draw (60 => 360 degree arc)
// rx = x axis outer radius
// ry = y axis outer radius
// w  = width (thickness) of arc in pixels
// colour = 16 bit colour value
// Note if rx and ry are the same then an arc of a circle is drawn

void fillArc(int x, int y, int start_angle, int seg_count, int rx, int ry, int w, unsigned int colour)
{

  byte seg = 6; // Segments are 3 degrees wide = 120 segments for 360 degrees
  byte inc = 6; // Draw segments every 3 degrees, increase to 6 for segmented ring

  // Calculate first pair of coordinates for segment start
  float sx = cos((start_angle - 90) * DEG2RAD);
  float sy = sin((start_angle - 90) * DEG2RAD);
  uint16_t x0 = sx * (rx - w) + x;
  uint16_t y0 = sy * (ry - w) + y;
  uint16_t x1 = sx * rx + x;
  uint16_t y1 = sy * ry + y;

  // Draw colour blocks every inc degrees
  for (int i = start_angle; i < start_angle + seg * seg_count; i += inc)
  {

    // Calculate pair of coordinates for segment end
    float sx2 = cos((i + seg - 90) * DEG2RAD);
    float sy2 = sin((i + seg - 90) * DEG2RAD);
    int x2 = sx2 * (rx - w) + x;
    int y2 = sy2 * (ry - w) + y;
    int x3 = sx2 * rx + x;
    int y3 = sy2 * ry + y;

    tft.fillTriangle(x0, y0, x1, y1, x2, y2, colour);
    tft.fillTriangle(x1, y1, x2, y2, x3, y3, colour);

    // Copy segment end to sgement start for next segment
    x0 = x2;
    y0 = y2;
    x1 = x3;
    y1 = y3;
  }
}

// #########################################################################
// Return the 16 bit colour with brightness 0-100%
// #########################################################################
unsigned int brightness(unsigned int colour, int brightness)
{
  byte red = colour >> 11;
  byte green = (colour & 0x7E0) >> 5;
  byte blue = colour & 0x1F;

  blue = (blue * brightness) / 100;
  green = (green * brightness) / 100;
  red = (red * brightness) / 100;

  return (red << 11) + (green << 5) + blue;
}

// #########################################################################
// Return a 16 bit rainbow colour
// #########################################################################
unsigned int rainbow(byte value)
{
  // Value is expected to be in range 0-127
  // The value is converted to a spectrum colour from 0 = blue through to 127 = red

  switch (state)
  {
  case 0:
    green++;
    if (green == 64)
    {
      green = 63;
      state = 1;
    }
    break;
  case 1:
    red--;
    if (red == 255)
    {
      red = 0;
      state = 2;
    }
    break;
  case 2:
    blue++;
    if (blue == 32)
    {
      blue = 31;
      state = 3;
    }
    break;
  case 3:
    green--;
    if (green == 255)
    {
      green = 0;
      state = 4;
    }
    break;
  case 4:
    red++;
    if (red == 32)
    {
      red = 31;
      state = 5;
    }
    break;
  case 5:
    blue--;
    if (blue == 255)
    {
      blue = 0;
      state = 0;
    }
    break;
  }
  return red << 11 | green << 5 | blue;
}
#if WebSever_EN
// web网站相关函数
// web设置页面
void handleconfig()
{
  String msg = "Ready...";
  int web_cc, web_setro, web_lcdbl, web_upt, web_dhten;

  if (server.hasArg("web_ccode") || server.hasArg("web_bl") ||
      server.hasArg("web_upwe_t") || server.hasArg("web_DHT11_en") || server.hasArg("web_set_rotation"))
  {
    web_cc = server.arg("web_ccode").toInt();
    web_setro = server.arg("web_set_rotation").toInt();
    web_lcdbl = server.arg("web_bl").toInt();
    web_upt = server.arg("web_upwe_t").toInt();
    web_dhten = server.arg("web_DHT11_en").toInt();
    Serial.println("");
    web_cc = (web_cc == 101281001) ? 101281009 : web_cc; // 湛江的代码改为霞山代码，解决湛江的代码取不到其他区的预警信号
    if (web_cc >= 101000000 && web_cc <= 102000000)
    {
      saveCityCodetoEEP(&web_cc);
      readCityCodefromEEP(&web_cc);
      cityCode = web_cc;
      Serial.print("城市代码:");
      Serial.println(web_cc);
      UpdateWeater_en = 1;
      weatherWarn.config(HeUserKey, cityCode); // 配置请求信息  101230201厦门 101230201 厦门  101281006 湛江 101281009 霞山
      UpdateScreen = 1;
      msg = "Sent OK!!!";
    }
    if (web_lcdbl > 0 && web_lcdbl <= 255)
    {
      EEPROM.write(BL_addr, web_lcdbl); // 亮度地址写入亮度值
      EEPROM.commit();                  // 保存更改的数据
      delay(5);
      LCD_BL_PWM = EEPROM.read(BL_addr);
      delay(5);
      Serial.print("亮度调整为：");
      // analogWrite(LCD_BL_PIN, 1023 - (LCD_BL_PWM * 10));
      ledcAnalogWrite(pwm_channel0, LCD_BL_PWM);
      Serial.println(LCD_BL_PWM);
      Serial.println("");
      msg = "Sent OK!!!";
    }
    if (web_upt > 0 && web_upt <= 60)
    {
      EEPROM.write(UpWeT_addr, web_upt); // 时间间隔写入亮度值
      EEPROM.commit();                   // 保存更改的数据
      delay(5);
      updateweater_time = EEPROM.read(UpWeT_addr);
      delay(5);
      // updateweater_time = web_upt;
      Serial.print("天气更新时间（分钟）:");
      Serial.println(web_upt);
      msg = "Sent OK!!!";
    }

    EEPROM.write(DHT_addr, web_dhten);
    EEPROM.commit(); // 保存更改的数据
    delay(5);
    if (web_dhten != DHT_img_flag)
    {
      DHT_img_flag = web_dhten;
      tft.fillScreen(0x0000);

      UpdateScreen = 1;
      isNewWeather = 1;
      msg = "Sent OK!!!";
    }
    Serial.print("DHT Sensor Enable： ");
    Serial.println(DHT_img_flag);

    EEPROM.write(Ro_addr, web_setro);
    EEPROM.commit(); // 保存更改的数据
    delay(5);
    if (web_setro != LCD_Rotation)
    {
      LCD_Rotation = web_setro;
      tft.setRotation(LCD_Rotation);
      tft.fillScreen(0x0000);
      isNewWeather = 1;
      UpdateScreen = 1;
      msg = "Sent OK!!!";
 
      TJpgDec.drawJpg(15, 183, temperature, sizeof(temperature)); // 温度图标
      TJpgDec.drawJpg(15, 213, humidity, sizeof(humidity));       // 湿度图标
    }
    Serial.print("LCD Rotation:");
    Serial.println(LCD_Rotation);
  }

  // 网页界面代码段
  String content = "<html><style>html,body{ background: #1aceff; color: #fff; font-size: 10px;}</style>";
  content += "<body><form action='/' method='POST'><br><div>SDD Web Config</div><br>";
  content += "City Code:<br><input type='text' list='fruits' id='cityid' onclick='clearinput()' name='web_ccode' placeholder='city code' value='" + cityCode + "'><br>";
  content += "<datalist id='fruits'>\
              <option value='101281001'>\
              <option value='101281002'>\
              <option value='101281003'>\
              <option value='101281004'>\
              <option value='101281005'>\
              <option value='101281006'>\
              <option value='101281007'>\
              <option value='101281008'>\
              <option value='101281009'>\
              <option value='101010100'>\
              <option value='101020100'>\
              <option value='101230201'>\
              <option value='101280101'>\
              <option value='101250101'>\
              <option value='101110101'>\
              </datalist>";
  content += "<br>Back Light(1-255):(default:50)<br><input type='text' name='web_bl' placeholder='50' value='" + String(LCD_BL_PWM, DEC) + "'><br>";
  content += "<br>Weather Update(1-60) Time:(default:10)<br><input type='text' name='web_upwe_t' placeholder='10' value= '" + String(updateweater_time, DEC) + "'><br>";
#if DHT_EN
  content += "<br>DHT Sensor Enable  <input type='radio' name='web_DHT11_en' value='0' ";
  content += (DHT_img_flag == 0) ? "checked" : "";
  content += "> DIS <input type='radio' name='web_DHT11_en' value='1' ";
  content += (DHT_img_flag == 1) ? "checked" : "";
  content += "> EN<br>";
#endif
  content += "<br>LCD Rotation<br>\
                    <input type='radio' name='web_set_rotation' value='0'";
  content += (LCD_Rotation == 0) ? "checked" : "";
  content += "> USB Down<br>\
                    <input type='radio' name='web_set_rotation' value='1'";
  content += (LCD_Rotation == 1) ? "checked" : "";
  content += "> USB Right<br>\
                    <input type='radio' name='web_set_rotation' value='2'";
  content += (LCD_Rotation == 2) ? "checked" : "";
  content += "> USB Up<br>\
                    <input type='radio' name='web_set_rotation' value='3'";
  content += (LCD_Rotation == 3) ? "checked" : "";
  content += "> USB Left<br>";
  content += "<br><div><input type='submit' name='Save' value='Save'></form></div>" + msg + "<br>";
  content += "By WCY<br>";
  content += "<script> function clearinput(){document.getElementById('cityid').value='';}</script>";
  content += "</body>";
  content += "</html>";

  server.send(200, "text/html", content);
}

