hgr2004/ESP32_Weather/src/main.cpp
// no need authentication
void handleNotFound()
{
  String message = "File Not Found\n\n";
  message += "URI: ";
  message += server.uri();
  message += "\nMethod: ";
  message += (server.method() == HTTP_GET) ? "GET" : "POST";
  message += "\nArguments: ";
  message += server.args();
  message += "\n";
  for (uint8_t i = 0; i < server.args(); i++)
  {
    message += " " + server.argName(i) + ": " + server.arg(i) + "\n";
  }
  server.send(404, "text/plain", message);
}

String mdnsName;
// Web服务初始化
void Web_Sever_Init()
{
  uint32_t counttime = 0; // 记录创建mDNS的时间
  String chipid;
  chipid = WiFi.macAddress(); // The chip ID is essentially its MAC address(length: 6 bytes).
  mdnsName = "SD" + chipid.substring(12, 14);

  Serial.println("mDNS responder building...");
  counttime = millis();
  while (!MDNS.begin(mdnsName))
  {
    if (millis() - counttime > 30000)
      ESP.restart(); // 判断超过30秒钟就重启设备
  }

  Serial.println("mDNS responder started");

  server.on("/", handleconfig);
  server.onNotFound(handleNotFound);

  // 开启TCP服务
  server.begin();
  Serial.println("HTTP服务器已开启");

  Serial.println("连接: http://" + mdnsName + ".local");
  Serial.print("本地IP： ");
  Serial.println(WiFi.localIP());
  // 将服务器添加到mDNS
  MDNS.addService("http", "tcp", 80);
}
// Web网页设置函数
void Web_Sever()
{
  if (WiFi.status() != WL_CONNECTED)
  {
    Serial.println("getCitycode Error:WiFi is not Connected.");
    LostWiFi = true;
    return;
  }
  else
  {
    LostWiFi = false;
  }
  // MDNS.update();
  server.handleClient();
}
// web服务打开后LCD显示登陆网址及IP
void Web_sever_Win()
{
  IPAddress IP_adr = WiFi.localIP();

  clk.setColorDepth(8);
  clk.loadFont("msyhbd20", FlashFS);
  clk.createSprite(220, 100);                         // 创建窗口
  clk.fillSprite(0x0000);                             // 填充率
  clk.drawRoundRect(0, 0, 200, 16, 8, 0xFFFF);        // 空心圆角矩形
  clk.fillRoundRect(3, 3, loadNum, 10, 5, TFT_GREEN); // 实心圆角矩形
  clk.setTextDatum(CC_DATUM);                         // 设置文本数据
  clk.setTextColor(TFT_GREEN, 0x0000);
  clk.drawString("WEB服务器已开启", 100, 40, 2);
  clk.setTextColor(TFT_WHITE, 0x0000);
  clk.drawRightString("可用网页进行配置", 180, 60, 2);
  clk.pushSprite(10, 120); // 窗口位置
  clk.deleteSprite();

  clk.createSprite(240, 20);
  clk.fillSprite(0x0000);
  clk.setTextDatum(CC_DATUM);
  clk.setTextColor(TFT_WHITE, 0x0000);
  clk.drawCentreString("http://" + mdnsName + ".local", 120, 0, 0);
  clk.pushSprite(10, 100);
  clk.deleteSprite();

  clk.createSprite(240, 20);
  clk.fillSprite(0x0000);
  clk.setTextDatum(CC_DATUM);
  clk.setTextColor(TFT_ORANGE, 0x0000);
  clk.drawCentreString("IP:" + IP_adr.toString(), 120, 0, 2);
  clk.pushSprite(0, 70);
  clk.deleteSprite();

  clk.unloadFont();
}
// 读取保存城市代码
void saveCityCodetoEEP(int *citycode)
{
  for (int cnum = 0; cnum < 5; cnum++)
  {
    EEPROM.write(CC_addr + cnum, *citycode % 100); // 城市地址写入城市代码
    EEPROM.commit();                               // 保存更改的数据
    *citycode = *citycode / 100;
    delay(5);
  }
}
void readCityCodefromEEP(int *citycode)
{
  for (int cnum = 5; cnum > 0; cnum--)
  {
    *citycode = *citycode * 100;
    *citycode += EEPROM.read(CC_addr + cnum - 1);
    delay(5);
  }
}
#endif